{"logic1":[null,{"name":"Five Boys and Five Dogs","desc":"Eric, Bernard, Bart, Sidney, and Ralph have dogs named (in no particular order) Bowser, Fido, Rover, Snoopy, and Spot. These five dogs are (again in no particular order) a poodle, a basset, a terrier, a spaniel and a collie. From the clues given try to determine the name and the breed of each boy's dog.\n","clues":["No dog's name begins with the same letter as that of his master.\n","Rover is not Bart's or Sidney's dog.","Spot's master and the owner of the spaniel both have names beginning with the same letter.\n","Neither Eric's dog nor Bernard's dog is the basset, nor is Snoopy.\n","Bart's dog and the collie are not called Spot or Snoopy.\n","Ralph's dog is not a terrier."],"types":[{"type":"First M Owner","vals":["Eric","Bernard","Bart","Sidney","Ralph"]},{"type":"Dog Type","vals":["Poodle","Basset","Terrier","Spaniel","Collie"]},{"type":"Dog First","vals":["Bowser","Fido","Rover","Snoopy","Spot"]}],"rules":[{"name":"Clue 1 B","type":"!=","a":"Bowser","b":["Bernard","Bart"]},{"name":"Clue 1 S","type":"!=","a":"Sidney","b":["Snoopy","Spot"]},{"name":"Clue 1 R","type":"!=","a":"Ralph","b":"Snoopy"},{"name":"Clue 2","type":"!=","a":"Rover","b":["Bart","Sidney"]},{"name":"Clue 3","type":"=OR","a":["Spot","Spaniel"],"b":["Bernard","Bart"]},{"name":"Clue 3","type":"!=","a":"Spot","b":"Spaniel"},{"name":"Clue 4","type":"!=","a":"Basset","b":["Eric","Bernard","Snoopy"]},{"name":"Clue 5","type":"!=","a":"Bart","b":["Spot","Snoopy","Collie"]},{"name":"Clue 5","type":"!=","a":"Collie","b":["Spot","Snoopy"]},{"name":"Clue 6","type":"!=","a":"Ralph","b":"Terrier"}],"solution":[["Eric","Collie","Rover"],["Bernard","Terrier","Spot"],["Bart","Spaniel","Fido"],["Sidney","Basset","Bowser"],["Ralph","Poodle","Snoopy"]]},{"name":"Five Women Out to Dinner","desc":"Some women from the District Attorney's office went out to dinner last night. Elizabeth, Gladys, Barbara, Virginia and Gwendolyn were their names, and each ordered a different main course. Steak, ham, chicken, pork, and lamb were the only main courses on the menu. Each woman also ordered mashed potatoes, salad, and a different vegetable. The five vegetables on the menu were peas, carrots, corn, squash, and spinach. What main course and vegetable did each woman have?\n","clues":["The woman who had steak and corn sat on the left of Elizabeth and on the right of Gwendolyn.\n","The woman who had chicken doesn't play cards but the woman who had ham, the woman who had squash, and Barbara played bridge yesterday with Gwendolyn.\n","The woman who had squash did not have it with pork; Virginia did not order pork either.\n","The woman who had ham was recently married to Elizabeth's brother; the woman who had squash helped Elizabeth wrap her present.\n","Gladys's and Gwendolyn's vegetables begin with the same letter as do the vegetables of Elizabeth and Barbara.\n"],"types":[{"type":"First F","vals":["Elizabeth","Gladys","Barbara","Virginia","Gwen"]},{"type":"Main Course","vals":["Steak","Ham","Chicken","Pork","Lamb"]},{"type":"Appetizer","vals":["Peas","Carrots","Corn","Squash","Spinach"]}],"rules":[{"name":"Clue 1","type":"=","a":"Steak","b":"Corn"},{"name":"Clue 1","type":"!=","a":"Steak","b":["Elizabeth","Gwen"]},{"name":"Clue 2","type":"D","data":["Chicken","Ham","Squash","Barbara","Gwen"]},{"name":"Clue 3","type":"!=","a":"Pork","b":["Squash","Virginia"]},{"name":"Clue 4","type":"!=","a":"Elizabeth","b":["Ham","Squash"]},{"name":"Clue 5","type":"!=","a":"Peas","b":["Glady","Gwen","Elizabeth","Barbara"]}],"solution":[["Elizabeth","Chicken","Carrots"],["Gladys","Lamb","Squash"],["Barbara","Steak","Corn"],["Virginia","Ham","Peas"],["Gwen","Pork","Spinach"]]},{"name":"Parking Lot","desc":"Mr. Smith, Mr. Jones, Mr. Brown, Mr. Johnson, and Mr. Black work for the Tinyburg Electric Company. Their cars are different colors: red, yellow, green, blue, and white. As it happens, each man also drives a different type of car: a sedan, a station wagon, a sports car, a coupe, and a convertible. From the clues given try to determine the owner, color, and type of each car.\n","clues":["Neither Mr. Johnson nor Mr. Jones owns the red car, but one of them owns the convertible.\n","Mr. Jones, Mr. Brown, and the owner of the sedan sometimes go on camping trips with the owner of the yellow station wagon.\n","The coupe and the white car are owned by the men with the colorful last names.\n","Mr. Smith used to own the sports car but then he changed its original white color and sold it to one of the other men who did not paint it green.\n","Mr. Johnson owns a green car.\n"],"types":[{"type":"Car","vals":["Sedan","Sta. Wagon","Sports Car","Coupe","Convert."]},{"type":"Last M","vals":["Smith","Jones","Brown","Johnson","Black"]},{"type":"Color","vals":["Red","Yellow","Green","Blue","White"]}],"rules":[{"name":"Clue 1","type":"=","a":"Red","b":["Jones","Johnson"]},{"name":"Clue 1","type":"!=","a":"Convert.","b":["Smith","Brown","Black"]},{"name":"Clue 2","type":"=","a":"Yellow","b":"Sta. Wagon"},{"name":"Clue 2","type":"D","data":["Jones","Brown","Sedan","Yellow"]},{"name":"Clue 3","type":"D","data":["Coupe","White","Smith","Jones","Johnson"]},{"name":"Clue 4","type":"!=","a":"Sports Car","b":["Smith","White","Green"]},{"name":"Clue 5","type":"=","a":"Johnson","b":"Green"}],"solution":[["Sedan","Black","White"],["Sta. Wagon","Smith","Yellow"],["Sports Car","Jones","Blue"],["Coupe","Brown","Red"],["Convert.","Johnson","Green"]]},{"name":"Who Dun Its","desc":"One rainy evening, five military men were murdered in the old mansion on Willow Lane (a general, a captain, a lieutenant, a sergeant, and a corporal). The murders took place in the bedroom, basement, pantry, den, and attic of the house. No two men were murdered in the same room or with the same weapon. The weapons used were poison, a poker, a gun, a knife, and a shovel. From the clues given, try to determine the room in which each man was killed and the weapon used to do him in.\n","clues":["The murder with the shovel was not done in the den or the attic; neither the captain nor the lieutenant was killed with the shovel, nor was either killed in the den or the attic.\n","The captain was not murdered in the bedroom.\n","The poker was not the murder weapon used in the attic.\n","Neither the general nor the corporal was murdered with poison, a gun, or a shovel.\n","The man murdered in the basement had just had dinner with the corporal, the captain, the man done in with poison, and the victim of the poker.\n"],"types":[{"type":"Army Rank","vals":["General","Captain","Lieut.","Sergeant","Corporal"]},{"type":"Room","vals":["Bedroom","Basement","Pantry","Den","Attic"]},{"type":"Weapon","vals":["Poison","Poker","Gun","Knife","Shovel"]}],"solution":[["General","Den","Poker"],["Captain","Pantry","Gun"],["Lieut.","Bedroom","Poison"],["Sergeant","Basement","Shovel"],["Corporal","Attic","Knife"]]},{"name":"Visiting Relatives","desc":"During his summer vacation, John decided to visit some of his relatives--his cousin, his parents, his uncle, his nephew and his brother--who all live in different cities. The five cities they live in are St. Louis, Denver, Miami, San Francisco, and Boston. John used five different means of transportation to get from one city to another. He went by car, plane, bus, train, and motorcycle. From the clues given, try to determine the city in which each of his relatives live and the means of transportation John used to reach there.\n","clues":["He arrived by plane and bus at the two cities which are not on the coast.\n","His uncle and his cousin live on the east coast.\n","His nephew met his plane when arrived.\n","He did not arrive at his uncle's city by car and his uncle does not live in Boston.\n","He did not go by bus to St. Louis or to visit his parents and he did not go to his cousin's city by train or car.\n"],"types":[{"type":"City","vals":["St. Louis","Denver","Miami","S.F.","Boston"]},{"type":"Relationship","vals":["Cousin","Parents","Uncle","Nephew","Brother"]},{"type":"Transport Mode","vals":["Car","Plane","Bus","Train","Cycle"]}],"solution":[["St. Louis","Nephew","Plane"],["Denver","Brother","Bus"],["Miami","Uncle","Train"],["S.F.","Parents","Car"],["Boston","Cousin","Cycle"]]},{"name":"Family at Home","desc":"Each member of the Smith family--father, mother, daughter, son and aunt--is in a different room doing something. One is reading, one is writing a letter, one is watching T.V., one is on the telephone, and one is doing a crossword puzzle. The five rooms in which these activities are taking place are the living room, the dining room, a bedroom, the kitchen, and the den. Where is each family member and what is he or she doing?\n","clues":["Someone is reading in the living room.\n","Neither of the men is the person in the dining room or the person on the telephone but one of them is in the bedroom.\n","The person doing the crossword puzzle occasionally calls out for help with a clue to the person in the living room and the aunt.\n","The person in the den is not one of the women and is not writing, nor are the women writing the letter.\n","One of the parents is watching T.V. and one of the children is doing the crossword.\n","The person in the den is not doing a crossword puzzle.\n"],"types":[{"type":"Family","vals":["Father","Mother","Daughter","Son","Aunt"]},{"type":"Room","vals":["Living","Dining","Bedroom","Kitchen","Den"]},{"type":"Activity","vals":["Reading","Writing","T.V.","Phone","Crosswd"]}],"solution":[["Father","Den","T.V."],["Mother","Living","Reading"],["Daughter","Dining","Crosswd"],["Son","Bedroom","Writing"],["Aunt","Kitchen","Phone"]]},{"name":"Night Classes","desc":"Pamela, Dorothy, Rita, Eunice, and Bernice are each taking an art course and a foreign language course. The art courses are painting, drawing, sculpture, pottery, and graphics. The foreign languages are French, Italian, Spanish, German, and Chinese. From the clues given try to determine the art course and the language course each woman is taking.\n","clues":["The woman taking sculpture is not taking Italian.\n","Bernice and Pamela do not study Chinese but one takes pottery, and the other French.\n","The woman studying Italian has taken other courses with Dorothy and Eunice, but she has never had a class with the women taking drawing and pottery.\n","Dorothy does not study German.\n","Bernice, Dorothy, and Eunice drive to class together on Thursday night. In no particular order, one of these women takes graphics, one takes German, and the other one takes pottery.\n"],"types":[{"type":"First F","vals":["Pamela","Dorothy","Rita","Eunice","Bernice"]},{"type":"Art","vals":["Painting","Drawing","Sculpture","Pottery","Graphics"]},{"type":"Language","vals":["French","Italian","Spanish","German","Chinese"]}],"solution":[["Pamela","Drawing","French"],["Dorothy","Graphics","Chinese"],["Rita","Painting","Italian"],["Eunice","Sculpture","German"],["Bernice","Pottery","Spanish"]]},{"name":"Former Homes","desc":"A group of men live and work in New York City (Mr. Lester, Mr. Becket, Mr. Lennox, Mr. Standish, and Mr. Weiss). Formerly, each had made his home in two other cities. The men lived first in the cities of New Orleans, Seattle, Milwaukee, Denver, and Dallas. They then lived in the cities of San Francisco, Houston, Atlanta, Boston, and Los Angeles. From the clues given, try to determine the two former cities in which each man lived.\n","clues":["Mr. Weiss has always lived in the South, but Mr. Standish never has.\n","The man from New Orleans, the man from Denver and Mr. Lester all would have liked to have lived in San Francisco.\n","Mr. Becket has not lived in Milwaukee or New Orleans.\n","Neither Mr. Lennox or Mr. Standish has ever lived in a city with a two-word name.\n","Neither Mr. Lennox nor Mr. Weiss has ever lived on the west coast but one of them has always lived in Texas.\n"],"types":[{"type":"Last M","vals":["Lester","Becket","Lennox","Standish","Weiss"]},{"type":"City","vals":["New Orleans","Seattle","Milwaukee","Denver","Dallas"]},{"type":"City","vals":["San Fran","Houston","Atlanta","Boston","Los Angeles"]}],"solution":[["Lester","Milwaukee","Los Angeles"],["Becket","Seattle","San Fran"],["Lennox","Dallas","Houston"],["Standish","Denver","Boston"],["Weiss","New Orleans","Atlanta"]]},{"name":"Family Weddings","desc":"Last June, five brothers married five sisters on the same day, in the same church, five different ceremonies. The five brothers are Earl, Virgil, Lester, Leroy, and Ray. The five sisters (and brides) are Betty Lou, Peggy Sue, Mary Jane, Sally Jo, and Cindy Lee. From the clues given, try to determine the composition of each couple and the order in which the ceremonies were performed.\n","clues":["Lester was married after Cindy Lee and Mary Jane but before Earl and Leroy.\n","Betty Lou was not Lester's bride.\n","The first and last couples to be married featured Cindy Lee, Sally Jo, Virgil, and Leroy.\n"],"types":[{"type":"First M","vals":["Earl","Virgil","Lester","Leroy","Ray"]},{"type":"Full F","vals":["Betty Lou","Peggy Sue","Mary Jane","Sally Jo","Cindy Lee"]},{"type":"Order_","vals":["First","Second","Third","Fourth","Fifth"]}],"solution":[["Earl","Betty Lou","Fourth"],["Virgil","Cindy Lee","First"],["Lester","Peggy Sue","Third"],["Leroy","Sally Jo","Fifth"],["Ray","Mary Jane","Second"]]},{"name":"The Little Big Top","desc":"Victor, Virgil, Vincent, Vito, and Vance are brothers performing in a five-man traveling circus known as the Little Big Top. They are, in no particular order, a clown, a juggler, an acrobat, a magician, and a strong man. Whenever they perform, their acts appear in the same order. From the clues given try to determine each brother's act and the order in which they perform.\n","clues":["The clown comes on after Victor and Vito but before the magician.\n","The acrobat comes on third.\n","Neither the strong man nor Vincent is the first or last to perform.\n","Virgil, Victor, and Vito perform in that order.\n"],"types":[{"type":"Circus Act","vals":["Clown","Juggler","Acrobat","Magician","Strong Man"]},{"type":"First M (V*)","vals":["Victor","Virgil","Vincent","Vito","Vance"]},{"type":"Order_","vals":["First","Second","Third","Fourth","Fifth"]}],"solution":[["Clown","Vincent","Fourth"],["Juggler","Virgil","First"],["Acrobat","Vito","Third"],["Magician","Vance","Fifth"],["Strong Man","Victor","Second"]]},{"name":"A Height and Hair Color Problem","desc":"Mary, Isobel, Marcia, Grace, and Ruth are on the Grand Avenue Grade School girls' basketball team. Each girl has a different color hair. The hair colors are blond, red, auburn, black, and brunette. As it happens, no two girls on the team are the same height; they are 5'9\", 5'8\", 5'6\", 5'5\", and 5'4\". From the clues given try to determine the hair color and height of each of the girls on the team.\n","clues":["Mary is taller than Ruth who is two inches taller than the redhead.\n","The brunette is not 5'6\".\n","Marcia and Mary are neither the tallest nor the shortest.\n","The girl with black hair is two inches taller than Ruth.\n","Isobel is taller than the blond, who is one inch taller than Grace.\n"],"types":[{"type":"First F","vals":["Mary","Isobel","Marcia","Grace","Ruth"]},{"type":"Hair Color","vals":["Blond","Red","Auburn","Black","Brunette"]},{"type":"Height_","vals":["5'9\"","5'8\"","5'6\"","5'5\"","5'4\""]}],"solution2":["031","140","203","314","422"]},{"name":"Five Daughters' Sons","desc":"Between January 1 and May 31, Mrs. Jackson's daughters Jane, Jean, Joan, June, and Jill, gave birth to five sons. The names of the boys, in no particular order, are Leonard, Edward, Harry, Malcolm, and David. What was the name of each daughter's son and in what month was he born? Each daughter gave birth in a different month.\n","clues":["Jill's baby was born after Harry and they were both born after Leonard.\n","David was born before Harry but neither David nor Malcolm was born first or last.\n","Joan, Jane, and Jean gave birth in that order.\n","Malcolm, June's son Edward, and the boy born in March all have blond hair.\n","Joan's son is older than both Harry and Malcolm.\n"],"types":[{"type":"First F (J*)","vals":["Jane","Jean","Joan","June","Jill"]},{"type":"First M","vals":["Leonard","Edward","Harry","Malcolm","David"]},{"type":"Month_","vals":["January","February","March","April","May"]}],"solution2":["041","122","200","314","433"]},{"name":"Five Students Cross Main","desc":"Main Street in Smallville is crossed by these other streets: River, Oak, Highland, Northfield, and Evergreen. Each street name is followed by one of the following: Avenue, Boulevard, Road, Lane, or Drive. From the clues given, try to determine the name of each street and the order in which one would cross them if one were coming down Main Street.\n","clues":["Evergreen Boulevard is not the first or the last street one would cross.\n","One would cross Evergreen before Oak, which one would cross before the Avenue.\n","The Road comes after the Boulevard but before the Lane and they all come before Highland.\n","River is the middle street.\n"],"types":[{"type":"Street Name","vals":["River","Oak","Highland","Northfield","Evergreen"]},{"type":"Street Type","vals":["Avenue","Boulevard","Road","Lane","Drive"]},{"type":"Order_","vals":["First","Second","Third","Fourth","Fifth"]}],"solution2":["022","133","204","340","411"]},{"name":"Commemorative Stamps","desc":"Edison, Marconi, the Wright Brothers, Franklin, and Bell, are pictured on 5 cent, 10 cent, 15 cent, 20 cent and 25 cent stamps which are red, blue, green, gray, and yellow. Whose picture is on what colored stamp and what is the value of each?\n","clues":["The Edison stamp is worth more than the brown one which costs more than the Marconi stamp.\n","The Wright Brothers stamp costs twice as much as the green one.\n","The blue stamp costs less than the Franklin stamp but more than the 15 cent red one.\n","The Edison stamp did not cost 20 cents.\n"],"types":[{"type":"Last M (Famous)","vals":["Edison","Marconi","Wright","Franklin","Bell"]},{"type":"Color","vals":["Red","Blue","Green","Gray","Brown"]},{"type":"Cents_","vals":[5,10,15,20,25]}],"solution2":["002","120","241","334","413"]},{"name":"Family Favorites","desc":"The members of the Jones family--the father, the mother, the daughter, the son, and the aunt--each have a favorite television program. One likes a comedy, one a western, one a drama, one an interview show, and one a sports program. Each of the favorite programs is on a different weeknight. From the clues given try to determine the type of show that is each person's favorite and the night it is on.\n","clues":["The comedy is not on Tuesday.\n","None of the women's favorite shows is a sports program or the one on Wednesday night.\n","The mother's favorite show is on earlier in the week than the drama but later than the son's favorite show.\n","One of the parents likes a western and the other likes a show that is on Monday.\n","The daughter does not like the interview show.\n"],"types":[{"type":"Family","vals":["Father","Mother","Daughter","Son","Aunt"]},{"type":"TV Show Type","vals":["Comedy","Western","Drama","Interview","Sports"]},{"type":"Weekday_","vals":["Monday","Tuesday","Wednesday","Thursday","Friday"]}],"solution2":["040","113","224","302","431"]},{"name":"Two Weeks Vacation","desc":"Gardner, Plunkett, Maloney, Phelps, and Lopez work for the Littleville fire department. They each get two weeks vacation per year. As it happens, last year they each took their first week in the first five months of the year and their second week in the last five months of the year. Remembering that each man took each of his weeks in a different month, try to determine the months in which each man took his first and second weeks.\n","clues":["Mr. Plunkett took his first week before Mr. Gardner who took his before Mr. Phelps; for their second week the order was reversed.\n","The man who vacationed in March also vacationed in September.\n","Mr. Lopez did not take his first week in April or in March.\n","Neither Mr. Lopez nor the man who took his first week in January took his second week in August or December.\n","Mr. Maloney took his second week before Mr. Plunkett but after Mr. Lopez.\n"],"types":[{"type":"Last M","vals":["Gardner","Plunkett","Maloney","Phelps","Lopez"]},{"type":"Month_ First","vals":["Jan","Feb","March","April","May"]},{"type":"Month_ Last","vals":["August","Sept","Oct","Nov","Dec"]}],"solution2":["021","114","203","330","442"]},{"name":"Royalty of the Land of Pirnz","desc":"Among the royalty of the land of Pirnz are Velve, Brint, Draz, Flard, and Sorn. In no particular order, their titles are queen, marquis, duke, baron, and duchess. Their ages are 25, 30, 35, 40, and 45. From the clues given try to determine the age and title of each of the five.\n","clues":["Flard is younger than Sorn who is younger than the queen but the duchess is older than all three.\n","Velve is older than the baron who is older than Brint but none of these three is the youngest.\n","Draz is not the oldest, nor is Draz the name of any of the men.\n","Sorn is not 40 years old and neither is the duchess.\n","Brint is not the marquis.\n"],"types":[{"type":"Title (Royal)","vals":["Queen","Marquis","Duke","Baron","Duchess"]},{"type":"Last","vals":["Velve","Brint","Draz","Flard","and Sorn"]},{"type":"Age_","vals":[45,50,35,30,25]}],"solution2":["021","134","213","342","400"]},{"name":"Sportsville Teams","desc":"There are four stadiums in Sportsville: Memorial, the Coliseum, Central, and All Saints. These are the home grounds for the football, soccer, baseball, tennis, and basketball teams. Two teams share the same stadium. The five teams are the Blazers, the Fireballs, the Streaks, the Flames, and the Demons. From the clues given, try to determine the nickname of each sports team and the stadium at which they play.\n\n  NOTE: Two teams share the same stadium.\n  When solved, Shared = Coliseum.\n","clues":["Neither the Demons nor the team that plays at Central must share its stadium but the Flames must.\n","The football team doesn't play at Central stadium and it shares its stadium with the Streaks.\n","The basketball team, the baseball team, and the Fireballs do not share their stadiums.\n","The soccer team is not called the Fireballs and doesn't play at All Saints.\n","The tennis team plays at Memorial stadium but the baseball team does not play at All Saints.\n"],"types":[{"type":"Sport","vals":["Football","Soccer","Baseball","Tennis","Basket"]},{"type":"Sports Team","vals":["Blazers","Fireballs","Streaks","Flames","Demons"]},{"type":"Stadium","vals":["Memorial","Coliseum","Central","All Saints","Shared"]}],"solution2":["034","121","202","310","443"]},{"name":"The Photo Contest","desc":"There is a photography contest every year at the County Fair. In last year's contest, the top prizes were awarded to photographs of fish, trees, cats, tenements, flowers, and a bridge. Two of the prizes were won by one man. The men who won the top prizes were Mr. Vee, Mr. Kay, Mr. Jay, Mr. Dee, and Mr. X. From the clues given, try to determine who took each photograph and the prize that each picture won.\n\n  NOTE: Two of the prizes were won by one man.\n","clues":["The bridge and tenement photographs were taken by one man and neither picture won first or last prize.\n","The last name of the man who won first prize is alphabetically behind everyone except the man whose photograph is of trees.\n","Neither Mr. Jay's photograph nor the photos of the bridge and the tenement came in third.\n","The tenement photograph, the cat's photograph and Mr. Dee's photograph of flowers finished in that order.\n","The fish photograph received a higher prize than Mr. Jay's photograph which in turn did better than the flowers photograph.\n"],"types":[{"type":"Last M","vals":["Mr. Vee","Mr. Kay","Mr. Jay","Mr. Dee","Mr. X"]},{"type":"Painting Object","vals":["Fish","Trees","Cats","Tenement","Flowers","A Bridge"]},{"type":"Rank_","vals":[1,2,3,4,5,6]}],"solution2":["000","133","151","224","345","412"]},{"name":"The Russian Course","desc":"Edward, Mary, Robert, Howard, Harold, and Mabel are taking a night course in Russian at a university in Queens. They all come from Long Island but each comes from a different town: Huntington, Lake Success, Westbury, Mineola, Oyster Bay, and Great Neck. They are all employed--one is a broker, one an artist, one a doctor, one a banker, one an engineer, and one an editor. From the clues given try to determine where each person lives and what each person does for a living.\n","clues":["One of the women is an editor and tHe other one lives in Huntington.\n","The man from Oyster Bay, Mary, and the artist are all Harold's patients.\n","The engineer from Lake Success, the broker, and Mabel have plans to visit the Soviet Union soon; the others are taking the course as an intellectual exercise.\n","The man from Westbury, the broker, Robert, and Howard often make up a golf foursome.\n","Robert lives in Oyster Bay but he is not the engineer.\n","Edward and the banker often drive in_to class together as do the men from Lake Success and Great Neck.\n"],"types":[{"type":"First (3 M, 2 F)","vals":["Edward","Mary","Robert","Howard","Harold","Mabel"]},{"type":"Occupation","vals":["Broker","Artist","Doctor","Banker","Engineer","Editor"]},{"type":"Town","vals":["Huntington","Lake Success","Westbury","Mineola","Oyster Bay","Great Neck"]}],"solution2":["012","100","234","341","425","553"]},{"name":"The Secrets of Five Women","desc":"Rachel, Lydia, Elvira, Kate, and Vivian, whose last names, in no particular order, are Parsons, Lawrence, Carter, Volpe, and Milligan, all live on the same block in Tinyboro. From the clues given, try to determine the first and last name of each woman and her age. The smallest age difference is 10 years.\nNOTE: After solving, ages are [80, 60, 50, 40, 20]\n","clues":["Rachel's name is not Carter.\n","Kate is twice as old as Mrs. Milligan but only half as old as Lydia.\n","Elvira is 10 years older than Mrs. Lawrence but 10 years younger than Mrs. Parsons.\n","Vivian is 20 years older than Kate and 20 years younger than Mrs. Volpe.\n","Kate is 10 years younger than Elvira but 20 years older than Rachel.\n"],"types":[{"type":"First F","vals":["Rachel","Lydia","Elvira","Kate","Vivian"]},{"type":"Last F","vals":["Parsons","Lawrence","Carter","Volpe","Milligan"]},{"type":"Age__","vals":[5,4,3,2,1]}],"solution2":["044","130","222","313","401"]},{"name":"Dinner for a Family of Four","desc":"A family of four--father, mother, sister, and brother--went out to dinner. They each had a different meat, potato and vegetable. The four kinds of meat were steak, ham, pork, and lamb. The four types of potatoes were baked, mashed, french fried, and boiled. The four vegetables were peas, carrots, corn, and spinach. From the clues given, try to determine the meal eaten by each member of the family.\nAfter solving, seating order is\n  Daughter, Mother, Son, Father (circular table)\n","clues":["One child had lamb and the other had french fries.\n","One of the women had spinach and the other had pork.\n","The father sat on the right of the person who had corn, who sat on the right of the person who had pork, who sat on the right of the person who had baked potatoes, who sat on the right of the person who had peas.\n","One parent had boiled potatoes and the other had steak.\n","One of the men had steak and the other had french fries.\n"],"types":[{"type":"Family","vals":["Father","Mother","Sister","Brother"]},{"type":"Meat","vals":["Steak","Ham","Pork","Lamb"]},{"type":"Potato","vals":["Baked","Mashed","F.F.","Boiled"]},{"type":"Vegetable","vals":["Peas","Carrots","Corn","Spinach"]}],"solution2":["0010","1231","2122","3303"]},{"name":"Two-Card Hand","desc":"Joe, Harry, Al, and Vince play a type of card game in which each player receives two cards. In one hand, each man received two cards in the same suit, and no man received cards in the same suit as any other man. The four suits are, of course, spades, hearts, diamonds and clubs. The first cards were an ace, a king, a queen, and a jack. The second cards were a ten, a nine, an eight, and a seven. From the clues given, try to determine the first and second card that each man received and the suit that both cards were in.\n","clues":["Al and Vince both have a picture card, and one of them has spades and the other the nine.\n","The man with the king does not have hearts or the seven and neither does Joe.\n","Harry does not have the jack or the eight.\n","Al sits to the right of Harry who sits to the right of the man with diamonds who sits to the right of the man with the queen of clubs.\n","The jack, the ten, the eight, and the diamonds are in four different hands.\n"],"types":[{"type":"First M","vals":["Joe","Harry","Al","Vince"]},{"type":"Suit","vals":["Spades","Hearts","Diamonds","Clubs"]},{"type":"Royal Card","vals":["Ace","King","Queen","Jack"]},{"type":"# Card","vals":["Ten","Nine","Eight","Seven"]}],"solution2":["0322","1100","2033","3211"]},{"name":"College Roommates","desc":"Five college seniors--John, Oscar, Earl, Ernie, and Marvin--rent an off-campus house. Each one is majoring in a different subject--psychology, chemistry, biology, math, or physics. They are attending college on sports scholarships in five sports: football, baseball, track, tennis, and swimming. And each is taking a different foreign language: French, Spanish, Italian, German, and Russian. From the clues given, try to determine the language, the sport, and the major of each of the five students.\n","clues":["The biology major, the swimmer, the student taking Italian, and Marvin have never missed any of Ernie's home football games.\n","Neither Oscar nor Earl is the one who takes Spanish or the one who is a physics major, but one of them is a baseball player.\n","Marvin and the track star had lunch with the math major and later on met Oscar after his German class. The baseball player, the math major, and Oscar all have rooms on the top floor, whereas John and the physics major have rooms on the ground floor.\n","The psychology major is taking German.\n","The biology major is not the track star and does not take Russian.\n"],"types":[{"type":"First M","vals":["John","Oscar","Earl","Ernie","Marvin"]},{"type":"Language","vals":["French","Spanish","Italian","German","Russian"]},{"type":"Sport","vals":["Football","Baseball","Track","Tennis","Swimming"]},{"type":"Major","vals":["Psych.","Chem.","Biology","Math.","Physics"]}],"solution2":["0221","1340","2012","3103","4434"]},{"name":"Four by Five eMs","desc":"Five miners from Minnesota--Mike, Mark, Matthew, Malcolm, and Marvin--all man the same mine. Their last names, in no particular order, are MacNab, Miller, Morrison, Murdoch, and Meyers. Their wives' names, also in no particular order, are Mary, Mabel, Martha, Miriam, and Marcia. As it happens they all live on streets with names beginning with the letter \"m.\" The streets are Main, Maple, Market, Mulberry, and Madison. From the clues given, try to determine each man's last name, the name of his wife, and the name of the street on which each couple lives.\n","clues":["Martha, Mabel, and Miriam play golf with Mrs. MacNab, but the woman who is married to Mark and lives on Madison does not play.\n","Matthew, Mike Miller, Marvin, and the man who lives on Madison played poker last night at Mr. Murdoch's house on Market Street.\n","Mrs. Miller, who lives on Main Street, and the woman who lives on Madison work with Mary in Mr. Morrison's office at the mine, although none of these women is married to him.\n","Mabel is married to Malcolm, but Miriam is not married to Matthew.\n","Miriam had dinner last week with the Millers and the couple from Maple Street.\n"],"types":[{"type":"First F (M*)","vals":["Mike","Mark","Matthew","Malcolm","Marvin"]},{"type":"First M (M*)","vals":["Mary","Mabel","Martha","Miriam","Marcia"]},{"type":"Last (M*)","vals":["MacNab","Miller","Morrison","Murdoch","Meyers"]},{"type":"Street (M*)","vals":["Main","Maple","Market","Mulberry","Madison"]}],"solution2":["0201","1332","2010","3423","4144"]},{"name":"The Pie Contest","desc":"Among prize winners in the pie contest at the County Fair are Mrs. Plumcott, Mrs. Custardine, Mrs. Appleby, Mrs. Peachet, and Mrs. Lemoni. In no particular order their first names are Janet, Lydia, Victoria, Vivian, and Doris. From the clues given, try to determine the first and last name of each woman, the type of pie she baked (custard, peach, lemon, apple, or plum), and the prize, first through fifth, that she won.\n","clues":["Mrs. Custardine's pie finished ahead of the plum pie which finished ahead of Doris's pie, but none of these won first prize.\n","Neither the peach nor the custard pie was baked by Victoria or Mrs. Lemoni.\n","Mrs. Peachet's custard pie received a higher prize than Vivian's pie which in turn did better than Mrs. Plumcott's lemon pie.\n","Mrs. Custardine's pie finished oehind Mrs. Peachet's pie and they both finished behind Lydia's pie.\n","Lydia's last name is not Lemoni and she did not bake the lemon pie.\n"],"types":[{"type":"Last F","vals":["Plumcott","Custardine","Appleby","Peachet","Lemoni"]},{"type":"First F","vals":["Janet","Lydia","Victoria","Vivian","Doris"]},{"type":"Pie Type","vals":["Custard","Peach","Lemon","Apple","Plum"]},{"type":"Rank_","vals":["First","Second","Third","Fourth","Fifth"]}],"solution2":["0424","1232","2110","3001","4343"]},{"name":"Music Poll","desc":"Musicians Joe, Jim, John, Jake, and Josh recently finished in the top five positions of a music poll. Each plays in a different type of group--soul, jazz, country & western, reggae, and folk--and each performer plays a different instrument. From the clues given, try to determine for each position on the poll, the man, his type of group, and the instrument he plays.\n","clues":["The bass-player's reggae group finished third.\n","The folk and country & western groups do not have keyboard instruments in them and neither does Josh's group.\n","Jake's group placed higher in the polls than the bass-player's group which placed higher than the soul group but none of these groups finished first.\n","The drummer's group finished behind John's group but ahead of the jazz group; however, none of these groups finished last.\n","The guitar player's group does not play country & western.\n","Joe does not play his piano in the soul group.\n"],"types":[{"type":"Music Type","vals":["Soul","Jazz","C & W","Reggae","Folk"]},{"type":"First M (J*)","vals":["Joe","Jim","John","Jake","Josh"]},{"type":"Instrument","vals":["Drums","Guitar","Bass","Piano","Organ"]},{"type":"Position_","vals":[1,2,3,4,5]}],"solution2":["0144","1033","2301","3422","4210"]},{"name":"Park Street Residents","desc":"The Wilcoxes, the Byrds, the Talmadges, the Marsdens, and the Levers all live on the west side of Park Street. The numbers on the houses run from south to north, with the highest number being the most northerly, and only odd numbers are used on the west side of the street. Each house has white trim, but the main color of each house is different. The colors are red, brown, tan, yellow, and green. On the front lawn of each house there is a different type of tree in the central position. The five trees are an oak, an elm, an ash, a willow, and a maple. From the clues given, try to determine for each family the color of the house, the type of tree they have planted out front, and the address number of the house.\n","clues":["The Lever house is the next house to the south of the tan house and the next house north of the house with an oak on its front lawn.\n","The Marsden house does not have an elm in its front lawn.\n","Neither the Wilcox house nor the Talmadge house has a tree on its front lawn with a three letter name, but the colors of both of their houses are three letter words.\n","The green house is the next one north of the Marsden house, which is the next house to the north of the house with a willow on its front lawn.\n","The Lever house is the one just north of the green house and just south of the house with the maple on its front lawn.\n","The Wilcox house and the Marsden house do not have a maple tree on either of their front lawns and neither does the brown house.\n"],"types":[{"type":"Last","vals":["Wilcox","Byrd","Talmadge","Marsden","Lever"]},{"type":"Tree","vals":["Oak","Elm","Ash","Willow","Maple"]},{"type":"Color","vals":["Red","Brown","Tan","Yellow","Green"]},{"type":"House Number_","vals":[9,7,5,3,1]}],"solution2":["0304","1042","2420","3233","4111"]},{"name":"Five Men on Sycamore","desc":"On Sycamore Street, in a small town in Connecticut, live Joshua, Malcolm, Trevor, Rupert, and Charles. Their last names are Holden, Berger, Whittier, Previn, and Brooking. Collectively, they are graduates of Columbia, Cornell, N.Y.U., Harvard, and Yale. After college, they pursued the following professions: doctor, teacher, actor, lawyer, and veterinarian. From the clues given try to determine the first and last name of each man, his profession, and his alma mater.\n","clues":["Malcolm was not the one who went to N.Y.U. nor the one who became an actor; neither was his friend Mr. Previn.\n","Yesterday the lawyer, the doctor, Joshua, the one who went to Cornell, and Trevor Whittier had lunch together. There were five men at the table.\n","Charles is the veterinarian.\n","Neither Rupert nor Joshua is named Brooking or Previn and it was not one of these four who became a teacher after going to N.Y.U.\n","The doctor and the one who went to Yale knew Rupert before he went to Harvard.\n","Joshua is not Mr. Berger.\n"],"types":[{"type":"First M","vals":["Joshua","Malcolm","Trevor","Rupert","Charles"]},{"type":"Last M","vals":["Holden","Berger","Whittier","Previn","Brooking"]},{"type":"University","vals":["Columbia","Cornell","N.Y.U.","Harvard","Yale"]},{"type":"Occupation","vals":["Doctor","Teacher","Actor","Lawyer","Vet."]}],"solution2":["0021","1400","2242","3133","4314"]},{"name":"Pauline's Five Men in Europe","desc":"All of Pauline's favorite male relatives live in Europe. They are her father, her uncle, her first cousin, her brother, and her husband. In no particular order, their names are Daniel, Edgar, Wilfred, Luther, and Walter. Although they all live in Europe, no two men live in the same city. The cities in which they live are London, Paris, Rome, Madrid, and Berlin. From the clues given, try to determine not only the city in which each man lives and his relationship to Pauline, but his occupation as well, be it diplomat, correspondent, student, artist or professor. Assume her husband is only related to the other men through marriage to her.\n","clues":["The man in Berlin is the father of the correspondent and the diplomat is the father of the man in Paris.\n","Luther is the son of the man in Rome and Walter is the artist's son.\n","Daniel is the father of the man in Madrid and Wilfred is the father of the student.\n","Her cousin does not live in Paris.\n"],"types":[{"type":"First M","vals":["Daniel","Edgar","Wilfred","Luther","Walter"]},{"type":"Family M","vals":["Father","Uncle","Cousin","Brother","Husband"]},{"type":"City","vals":["London","Paris","Rome","Madrid","Berlin"]},{"type":"Occupation","vals":["Diplomat","Corresp.","Student","Artist","Prof."]}],"solution2":["0143","1404","2020","3312","4231"]},{"name":"Joyce the Babysitter","desc":"Joyce is a popular babysitter. Billy, Bobby, Sam, Tommy, and Pete are her charges, and she babysits for each one on a different day of the week. She takes Saturday and Sunday off. As it happens, no two children are the same age and range in age from one to five. The mothers of the boys are Mrs. Clark, Mrs. Jolson, Mrs. Prescott, Mrs. Foster, and Mrs. Waters. From the clues given, try to determine each child's full name and age as well as the day of the week on which Joyce babysits for him.\n","clues":["Thursday's child is the oldest and Mrs. Jolson's child is not the youngest.\n","She sits for Mrs. Foster's son earlier in the week than for Pete but later than she sits for the two-year-old.\n","She doesn't sit for Billy or Tommy on Monday or Friday but one of them is the one-year-old and the other is the three-year-old.\n","She sits for Tommy the day before Billy but the day after the Clark baby.\n","In no particular order the three youngest children are the Monday child, the Tuesday child, and Mrs. Jolson's child.\n","Mrs. Prescott's son Sam is not the oldest nor is he the child watched on Monday.\n"],"types":[{"type":"Last F","vals":["Clark","Jolson","Prescott","Foster","Waters"]},{"type":"First M","vals":["Billy","Bobby","Sam","Tommy","Pete"]},{"type":"Weekday_","vals":["Mon","Tues","Wed","Thurs","Fri"]},{"type":"Age_","vals":[1,2,3,4,5]}],"solution2":["0101","1022","2243","3310","4434"]},{"name":"Race Results","desc":"The first race at the Middleville Track was a five-horse race. The horses were Stillwind, Fleur-de-Lis, Graymere, Fool's Friend, and Emergency. The jockeys--Smith, Jones, Wilson, McCoy, and Larson, each wore a cap of a different color. One wore red, one wore yellow, one blue, one green, and one wore orange. From the clues given, try to determine the jockey of each horse, the color of his cap and the order in which the race finished.\n","clues":["Graymere won but was not ridden by the jockey with the yellow cap.\n","Stillwind finished ahead of McCoy's horse but behind the blue-capped jockey; however, none of these finished first.\n","Neither Graymere, Fleur-de-Lis nor Emergency was ridden by the jockey with the red cap but one was ridden by Jones and another by Larson and the other was the horse who finished fourth.\n","Fool's Friend finished ahead of the horse ridden by the jockey in the red cap, who finished ahead of McCoy, who finished ahead of the jockey with the orange cap.\n","Neither Fleur-de-Lis nor Graymere was ridden by Larson or Smith and none of these horses or riders finished second.\n"],"types":[{"type":"Horse","vals":["Stillwind","Fleur-de-Lis","Graymere","Fool's Friend","Emergency"]},{"type":"Last (Jockey)","vals":["Smith","Jones","Wilson","McCoy","Larson"]},{"type":"Color","vals":["Red","Yellow","Blue","Green","Orange"]},{"type":"Rank_","vals":["First","Second","Third","Fourth","Fifth"]}],"solution2":["0002","1313","2130","3221","4444"]},{"name":"Birthday Boys","desc":"Mrs. Smith had five sons, Norman, Felix, Raymond, Wilbur, and Edward. Each was born in a different year (1948, 1950, 1951, 1956, and 1957) and each was born in a different month (January, April, July, September, and November). Mrs. Smith remembers clearly that no son was born on the weekend but each son was born on a different day of the week. From the clues given try to determine the day of the week, the month and the year of birth of each son.\n","clues":["Wilbur was not the son born on Wednesday nor was he the son born in July.\n","Raymond is older than the son born on a Thursday and younger than the son born in November, however, it is the two remaining sons who are the eldest and youngest.\n","The second eldest one and Felix both wear glasses but the son born on Friday, the son born in January, and Wilbur do not.\n","The son born in April was not born on Tuesday or Thursday and the son born in 1951 was not born on Monday or Friday.\n","The son born in 1948 was born on Wednesday and Norman was born on Monday.\n"],"types":[{"type":"First M","vals":["Norman","Felix","Raymond","Wilbur","Edward"]},{"type":"Weekday_","vals":["Mon","Tues","Wed","Thurs","Fri"]},{"type":"Month_","vals":["January","April","July","Sept","Nov"]},{"type":"Year_","vals":[1948,1950,1951,1956,1957]}],"solution2":["0043","1210","2302","3131","4424"]},{"name":"At the Movies","desc":"There are five movie theaters in Farville: the Strand, the Bijou, the Palace, the Capital, and the Odeon. Last week each one featured a different film starring the five favorite femme-fatales of Frankie (the film fanatic) Fusco. The five films starred Julie Christie, Bette Davis, Glenda Jackson, Marilyn Monroe (a revival film), and Katherine Hepburn. Each night during the week, Frankie went to see a different film. From the clues given try to determine the star, the theater, the type of film (drama, comedy, western, thriller, or mystery), and the night on which Frankie saw each film.\n","clues":["He did not see the western first but he saw it before the Marilyn Monroe film which he saw before the movie at the Odeon.\n","Neither Julie Christie nor Glenda Jackson played in the comedy but one of them was in the film at the Strand.\n","He saw the Glenda Jackson film before the mystery but after the drama.\n","The pictures at the Palace and the Capital were not the Bette Davis movie or the Katherine Hepburn western.\n","The mystery starred Bette Davis.\n","He saw the comedy before the thriller but after the film at the Palace.\n"],"types":[{"type":"Theater","vals":["Strand","Bijou","Palace","Capital","Odeon"]},{"type":"Last (Actor)","vals":["Christie","Davis","Jackson","Monroe","Hepburn"]},{"type":"Weekday_","vals":["Mon","Tues","Wed","Thurs","Fri"]},{"type":"Film Genre","vals":["Drama","Comedy","Western","Thriller","Mystery"]}],"solution2":["0233","1412","2000","3321","4144"]},{"name":"Like-Named Cats and Dogs","desc":"Joe, Bill, Bob, Jack, and Tom, whose last names are Carter, Dawson, Mingus, Wood, and Cole, live in an apartment building in New York. Each man owns a dog and a cat. The names of the dogs are Dusty, Midnight, Ginger, Smokey, and Daisy. Although the men do not know each other, it happens the five names they chose for their cats are the same five names chosen for the dogs. From the clues given, try to determine each man's first and last name and the names of his pets. (Hint: No man gave the same name to both his dog and his cat.)\n","clues":["Joe and Jack each have a pet named Ginger.\n","Jack, Joe, and Mr. Carter did not name any of their pets Midnight.\n","Bob's dog and Jack's cat have the same name, as do Bill's cat and Tom's dog.\n","The cat Daisy is not owned by Jack Cole, Mr. Mingus, Mr. Carter, or Bill.\n","Smokey the cat does not live with Ginger the dog, and neither of them live with Tom or Mr. Dawson.\n","Joe's dog is named Daisy.\n"],"types":[{"type":"First M","vals":["Joe","Bill","Bob","Jack","Tom"]},{"type":"Last M","vals":["Carter","Dawson","Mingus","Wood","Cole"]},{"type":"Cat","vals":["DustyC","MidnightC","GingerC","SmokeyC","DaisyC"]},{"type":"Dog","vals":["DustyD","MidnightD","GingerD","SmokeyD","DaisyD"]}],"solution2":["0225","1110","2033","3402","4341"]},{"name":"The Party","desc":"Last weekend, the Carsons had a party and invited the O'Tooles, Levines, Jacksons, Martins, and Smiths. The five husbands were named Elmer, John, David, Charles, and Stewart. The five wives were named Mary, Hilda, Madalene, Jessica, and Marlene. From the clues given try to determine not only the first and last names of each of the guests but also the order in which they arrived at the party. Keep in mind that each couple arrived together as a couple.\n","clues":["When Mary arrived, her brother David was already there, talking with Elmer Smith and the O'Tooles.\n","The Jacksons arrived after the Levines but before Jessica.\n","No person at the party has first and last names beginning with the same letter.\n","Neither Hilda nor Mrs. Martin is married to David.\n","John and Marlene arrived together after Elmer and before Mary, but none of these people arrived first.\n","Charles is not married to Jessica.\n"],"types":[{"type":"Last","vals":["O'Tooles","Levines","Jacksons","Martins","Smiths"]},{"type":"First M","vals":["Elmer","John","David","Charles","Stewart"]},{"type":"First F","vals":["Mary","Hilda","Madalene","Jessica","Marlene"]},{"type":"Order_","vals":["First","Second","Third","Fourth","Fifth"]}],"solution2":["0142","1220","2303","3434","4011"]},{"name":"Vital Statistics","desc":"Four men who work for the Littletown city government recently underwent their annual physical exams. The four men are Vince, Clem, Mort, and Phil. From the clues given, try to determine the exact age, height and weight of each of the four men.\n\n  After solving:\n  a = [45, 40, 35, 30]\n  h = [6'1\", 6'0\", 5'11\", 5'10\"]\n  w = [180, 175, 170, 165]\n","clues":["Mort is five years older than the tallest man and he is lighter than the shortest man.\n","Clem is taller than the oldest man and lighter than the youngest man.\n","Phil is two inches shorter and ten pounds heavier than Clem but Phil weighs less than the tallest man.\n","Someone is 6'1\" and 40 years old, and someone is 5'11\" and weighs 170 pounds.\n","The lightest man is five years older than the shortest man.\n","The youngest man is 30, one inch shorter than Mort, and five pounds lighter than Vince.\n","The man who is 6' is not Vince, 175-pound Phil, or the oldest man.\n"],"types":[{"type":"First M","vals":["Vince","Clem","Mort","Phil"]},{"type":"Age__","vals":["a4","a3","a2","a1"]},{"type":"Height__","vals":["h4","h3","h2","h1"]},{"type":"Weight__","vals":["w4","w3","w2","w1"]}],"solution2":["0100","1213","2022","3331"]},{"name":"Anniversaries","desc":"On June 1st, five couples who live in Smallboro will celebrate their wedding anniversaries. Their names are Johnstone, Parker, Watson, Graves, and Shearer. The husbands' first names are Russell, Douglas, Charles, Peter, and Everett. The wives' first names are Elaine, Joyce, Marcia, Elizabeth, and Mildred. Keep in mind that no two couples have been married the same number of years. From the clues given, try to determine the husband and wife that make up each couple and the number of years they have been married.\nSolved years: [5, 10, 20, 25, 30]\n","clues":["Joyce has not been married as long as Charles or the Parkers but longer than Douglas or the Johnstones.\n","Elizabeth has been married twice as long as the Watsons but only half as long as Russell.\n","The Shearers have been married ten years longer than Peter and ten years less than Marcia.\n","Douglas and Mildred have been married for 25 years less than the Graves who, having been married for 30 years, are the couple who have been married the longest.\n","Neither Elaine nor the Johnstones have been married the shortest amount of time.\n","Everett has been married for 25 years.\n"],"types":[{"type":"First M","vals":["Russell","Douglas","Charles","Peter","Everett"]},{"type":"First F","vals":["Elaine","Joyce","Marcia","Elizabeth","Mildred"]},{"type":"Last","vals":["Johnstone","Parker","Watson","Graves","Shearer"]},{"type":"Years__","vals":["y1","y2","y3","y4","y5"]}],"solution2":["0142","1420","2234","3301","4013"]}],"logic2":[null,{"name":"Prom Dresses","desc":"Five friends, whose names are Gail, Margery, Nora, Pamela, and Ramona, each wore a different colored dress to the senior prom. The colors of the dresses were blue, green, orange, pink, and yellow. In alphabetical order, the last names of the five girls are Clausen, Jensen, Mathers, Oblinski, and Smith. From the information given, determine the first and last name of each girl as well as the color of the dress that each one wore to the senior prom.\n","clues":["The girl who wore a blue dress and Ms. Mathers do not have the first name of Margery or Ramona.\n","Either Ms. Oblinski or Ms. Smith, who wore an orange dress, is named Pamela.\n","Margery is not Ms. Smith and she did not wear a pink dress.\n","Nora, Pamela, and Ms. Clausen did not wear a blue or orange dress.\n","Of Gail and Pamela, one is Ms. Jensen and one wore a green dress.\n"],"types":[{"type":"First F","vals":["Gail","Margery","Nora","Pamela","Ramona"]},{"type":"Last","vals":["Clausen","Jensen","Mathers","Oblinski","Smith"]},{"type":"Color","vals":["Blue","Green","Orange","Pink","Yellow"]}],"rules":[{"name":"Clue 1","type":"D","data":["Blue","Mathers","Margery","Ramona"]},{"name":"Clue 2","type":"=","a":"Pamela","b":["Oblinski","Smith"]},{"name":"Clue 2","type":"=","a":"Smith","b":"Orange"},{"name":"Clue 3","type":"!=","a":"Margery","b":["Smith","Pink"]},{"name":"Clue 4","type":"D","data":["Nora","Pamela","Clausen","Blue","Orange"]},{"name":"Clue 5","type":"=OR","a":["Jensen","Green"],"b":["Gail","Pamela"]},{"name":"Clue 5","type":"!=","a":"Jensen","b":"Green"}],"solution":[["Gail","Jensen","Blue"],["Margery","Clausen","Yellow"],["Nora","Mathers","Pink"],["Pamela","Oblinski","Green"],["Ramona","Smith","Orange"]]},{"name":"Double Gifts","desc":"Five women went shopping together to get birthday presents for a mutual friend. Their names are Nancy, Olivia, Rita, Sally, and Vivian. The five gifts that they bought for their friend are: gloves, a necklace, a sweater, a wallet, and a watch. While shopping each woman bought one of the same gifts for herself. From the information given, determine the gift that each woman bought for her friend as well as the gift that each one bought for herself.\n","clues":["Nancy and Rita did not buy a sweater or a wallet.\n","Vivian bought a necklace for herself and the woman who bought the same gift for her friend is not Rita.\n","Sally bought for herself the same thing that Olivia bought for her friend.\n","Vivian and Rita bought watches.\n","Sally did not buy a sweater for herself.\n"],"types":[{"type":"First F","vals":["Nancy","Olivia","Rita","Sally","Vivian"]},{"type":"Gift (Self)","vals":["GlovesS","NecklaceS","SweaterS","WalletS","WatchS"]},{"type":"Gift (Friend)","vals":["GlovesF","NecklaceF","SweaterF","WalletF","WatchF"]}],"solution":[["Nancy","GlovesS","NecklaceF"],["Olivia","SweaterS","WalletF"],["Rita","WatchS","GlovesF"],["Sally","WalletS","SweaterF"],["Vivian","NecklaceS","WatchF"]]},{"name":"Test Cars' MPGs","desc":"The miles-per-gallon ratings on a single model of a car may vary for many reasons, including the test driver and other factors. A new model line of popular car called the Zinx, during tests, produced mpg's of 32, 31, 30, 29, and 28. Each car was a different one of these five colors: blue, green, red, white, and yellow. Each car was driven by a different one of these five drivers: Cox, Durham, Gosling, Heynek, and Wollinsky. From the information given, determine the color and driver of each car, as well as the mpg attained by each one.\n","clues":["The driver named Durham got more mpg's than the green car but not as many as the red car.\n","The blue car got better mpg's than the car driven by Wollinsky.\n","Cox did not drive the green or red car.\n","The yellow car got more mpg's than the car driven by Gosling but not as many as the green car.\n"],"types":[{"type":"MPG_ (28-32)","vals":[32,31,30,29,28]},{"type":"Color","vals":["Blue","Green","Red","White","Yellow"]},{"type":"Last M","vals":["Cox","Durham","Gosling","Heynek","Wollinsky"]}],"solution":[[32,"Red","Heynek"],[31,"Blue","Durham"],[30,"Green","Wollinsky"],[29,"Yellow","Cox"],[28,"White","Gosling"]]},{"name":"Bank Employees","desc":"Sometimes people are perfect for their jobs. In the case of five employees of the Tinyboro bank this is very much the case. The five employees are named Cash, Coyne, El Grande, Finn, and Nicholson. In alphabetical order their names are Bill, Buck, Nick, Penny, and Senta. The positions that they hold at the bank are as a head teller, an officer, the president, a security guard, and a teller. From the information given, determine the first and last name of each employee and the position each holds at the bank.\n","clues":["The president is a man but neither he nor Buck has the last name of El Grande, Finn, or Nicholson.\n","Senta's last name is not Finn, and neither she nor Finn is the security guard.\n","The two tellers are not the same sex but one is named Nicholson and one is named Coyne.\n","Nick, Buck, and Mr. Cash are not the regular teller.\n","Neither Penny nor Mr. El Grande is the president.\n"],"types":[{"type":"Occupation (Bank)","vals":["Head Teller","Officer","President","Sec. Guard","Teller"]},{"type":"First (3 M, 2 F)","vals":["Bill","Buck","Nick","Penny","Senta"]},{"type":"Last","vals":["Cash","Coyne","El Grande","Finn","Nicholson"]}],"solution":[["Head Teller","Buck","Coyne"],["Officer","Penny","Finn"],["President","Bill","Cash"],["Sec. Guard","Nick","El Grande"],["Teller","Senta","Nicholson"]]},{"name":"Baseball-Hitting Contest","desc":"In a baseball-hitting contest at the office picnic, five men participated named: Biff, Carl, Fred, Marty, and Tom. Their last names, in alphabetical order, are Jenkins, Keech, MacNab, Miller, and Winslow. The distances that each man hit the ball in feet are 325, 300, 275, 250, and 200. From the information given, determine the first and last name of each man, as well as how far each one hit the baseball.\n","clues":["Mr. Miller didn't hit the ball as far as Biff, but he hit one farther than Tom.\n","Carl hit the ball farther than Marty, but not the farthest.\n","Fred hit a ball farther than Mr. MacNab but not as far as Mr. Keech, who didn't hit the ball the farthest.\n","Tom hit a ball farther than Mr. Winslow, whose first name is not Marty.\n"],"types":[{"type":"Distance_ (ft)","vals":[325,300,275,250,200]},{"type":"First M","vals":["Biff","Carl","Fred","Marty","Tom"]},{"type":"Last","vals":["Jenkins","Keech","MacNab","Miller","Winslow"]}],"solution2":["000","113","241","324","432"]},{"name":"Candidates","desc":"The five candidates for mayor in the town of Smallville were members of these five parties: Conservative, Democrat, Independent, Liberal, and Republican. Their names are Goshen, Hargreaves, Jensen, Liebowitz, and Nelson. From the information given, determine not only the party to which each of the candidates belong, but also the order of finish in the election.\n","clues":["The Democrat and the Independent, in no particular order, were the first- and fifth-place vote-getters, but neither one is named Hargreaves or Jensen.\n","Nelson did better than Liebowitz but not as well as the Republican.\n","Goshen is not an Independent candidate.\n","The Liberal did better than Jensen but not as well as Hargreaves.\n"],"types":[{"type":"Rank_","vals":["First","Second","Third","Fourth","Fifth"]},{"type":"Political Party","vals":["Conservative","Democrat","Independent","Liberal","Republican"]},{"type":"Last","vals":["Goshen","Hargreaves","Jensen","Liebowitz","Nelson"]}],"solution2":["010","141","234","302","423"]},{"name":"Birthdays in June","desc":"All of Ms. Johnson's children were born in June. Their birthdays are June 1, June 7, June 12, June 20, and June 29. There are three girls named Mary, Elvira, and Joan, and there are two boys named Douglas and Timothy. Ms. Johnson bought these five presents for them: a book, a coat, concert tickets, a dress, and an electronic game. From the information given, determine the birthday and present received by each child.\n","clues":["Timothy's birthday comes before that of the girl who received a dress but after the girl who received a coat.\n","Douglas's birthday comes before Elvira's birthday but after the birthday of the girl who received an electronic game.\n","Elvira did not receive the dress and neither did Joan.\n","Douglas did not get a book as a present.\n"],"types":[{"type":"June Day_","vals":["June 1","June 7","June 12","June 20","June 29"]},{"type":"First (3 F, 2 M)","vals":["Douglas","Elvira","Joan","Mary","Timothy"]},{"type":"Gift","vals":["Book","Coat","Concert Tix","Dress","Elec. Game"]}],"solution2":["024","102","211","340","433"]},{"name":"Win, Place, and Show Plus Two","desc":"In the big race at the Horseheads' racetrack the top five finishers were Full Sweep, Nightshade, Quartermain, Top Drawer, and Whirlaway. In alphabetical order, they were ridden by Alvarez, Hernandez, Perez, Pickman, and Wilson. From the information given, determine the order of finish of the race and the name of the jockey who rode each of the five horses.\n","clues":["Of Whirlaway and Quartermain, one finished first and one was ridden by Alvarez.\n","Pickman finished ahead of Perez but after Whirlaway, who did not win top money.\n","Full Sweep did not finish third.\n","Top Drawer finished ahead of Nightshade but after Wilson, who did not ride the winning horse.\n"],"types":[{"type":"Rank_","vals":["First","Second","Third","Fourth","Fifth"]},{"type":"Horse","vals":["Full Sweep","Nightshade","Quartermain","Top Drawer","Whirlaway"]},{"type":"Last","vals":["Alvarez","Hernandez","Perez","Pickman","Wilson"]}],"solution2":["021","104","240","333","412"]},{"name":"B-Ball Players","desc":"Bill, Ernie, Oscar, Sammy, and Tony are the five basketball players on the starting team of the varsity squad. Each one is known by a different one of these five nicknames: Slats, Stretch, Tiny, Tower, and Tree. From the information given, determine the nickname of each player as well as each of their heights, whether 6'6\", 6'5\", 6'3\", 6'1\", or 6' tall.\n","clues":["Oscar is taller than Tree who is taller than Tony.\n","Bill is taller than Sammy but shorter than Slats.\n","Tony's nickname is not Tiny.\n","Stretch is taller than Oscar but not the tallest.\n"],"types":[{"type":"Height_","vals":["6'6\"","6'5\"","6'3\"","6'1\"","6'"]},{"type":"Nickname","vals":["Slats","Stretch","Tiny","Tower","Tree"]},{"type":"First M","vals":["Bill","Ernie","Oscar","Sammy","Tony"]}],"solution2":["001","110","222","354","445"]},{"name":"Eye Doctors","desc":"Five eye doctors named Harlon, Harry, Henry, Herbert, and Horace operate an eye clinic. They each have one of these five unusual names: Eismann, Frayme, Glassman, Lenz, and Rimbaud. They each wear a different type of glasses from among these five: bifocals, contact lenses, reading glasses, regular glasses, and tinted lenses. From the information given, determine the first and last name of each man as well as the type of glasses worn.\n","clues":["Harry is not Mr. Glassman and he doesn't wear reading glasses.\n","Henry, Herbert, and Mr. Lenz do not wear bifocals or regular glasses.\n","Of Harlon and Herbert, one is named Eismann and one wears tinted lenses.\n","The man who wears bifocals and Mr. Rimbaud are not named Harry or Horace.\n"],"types":[{"type":"First M","vals":["Harlon","Harry","Henry","Herbert","Horace"]},{"type":"Last","vals":["Eismann","Frayme","Glassman","Lenz","Rimbaud"]},{"type":"Glasses","vals":["Bifocals","Contacts","Reading","Glasses","Regular","Tinted"]}],"solution2":["000","131","242","314","423"]},{"name":"Where are the Kids at 11 P.M.?","desc":"The Johnson kids are each upstairs in their bedrooms at 11 P.M. However, each one is doing something different, either doing crossword puzzles, drawing, reading, sleeping, or watching TV. The five kids are three boys named Albert, Daniel, and Ryan, and two girls named Cathy and Grace. They range in age from 14 to 18 years old. From the information given, determine each child's age and what he or she is doing at 11 P.M.\n","clues":["The eldest, a daughter, is not watching TV, or sleeping.\n","Grace is not reading or watching TV.\n","The child who is drawing is older than Grace but younger than Daniel.\n","The child who is reading is younger than Ryan but older than Albert.\n"],"types":[{"type":"Age_","vals":[18,17,16,15,14]},{"type":"First (3 M, 2 F)","vals":["Albert","Cathy","Daniel","Grace","Ryan"]},{"type":"Activity","vals":["Crosswords","Drawing","Reading","Sleeping","T.V."]}],"solution2":["010","144","222","301","433"]},{"name":"Forks in the Road","desc":"There are five forks in the road from Tratsburg to Denville. Turning left at each of these five forks will lead to one of these five towns: Asterly, Hornton, Seattle, Teasdale, and Thornberry. Turning right at each of the five forks will lead to one of these five towns: Estwater, Houston, Stewartville, Tewsbury, and Thousand Oaks. From the information given, determine the left and right turning at each fork in the road, as well as the order that a traveler would come upon the five forks heading from Tratsburg to Denville.\n","clues":["The fork in the road to Houston comes earlier than the one to Tewsbury but later than the ones to Teasdale or Thornberry, but neither of these two is a turning at the first fork in the road.\n","There is not a fork with roads to Stewartville and Asterly.\n","The fork with a road to Thousand Oaks comes before the one to Teasdale, but after the one to Stewartville.\n","The fork to Hornton is not at the same place as the one to Stewartville or Tewsbury.\n"],"types":[{"type":"Order_","vals":["First","Second","Third","Fourth","Fifth"]},{"type":"Town 1","vals":["Asterly","Hornton","Seattle","Teasdale","Thornberry"]},{"type":"Town 2","vals":["Estwater","Houston","Stewartville","Tewsbury","Thous. Oaks"]}],"solution2":["022","144","230","311","403"]},{"name":"Winter Vacations","desc":"Lucky Duckworth and his wife took five vacations last winter, one in each of the months of November, December, January, February, and March. Each vacation was for a different length of time, either two weeks, one week, five days, four days, or three days. They went to these five places: Bermuda, Hawaii, Jamaica, Puerto Rico, and Tahiti. From the information given, determine where they went on vacation each month and how long they stayed.\n","clues":["Their two longest vacations were in the Pacific but neither of these two longest vacations was in November or March.\n","They did not go to Puerto Rico for four days.\n","They went on a five-day vacation before going to Bermuda but after going to Puerto Rico.\n","The January vacation was longer and after the Tahitian vacation but before their vacation to Jamaica.\n"],"types":[{"type":"Month_","vals":["November","December","January","February","March"]},{"type":"Duration_","vals":["Two Weeks","One Week","Five Days","Four Days","Three Days"]},{"type":"City","vals":["Bermuda","Hawaii","Jamaica","Puerto Rico","Tahiti"]}],"solution2":["043","114","201","322","430"]},{"name":"Top Local Stations","desc":"The five top local radio stations in the town of Medio are WIGT, WKCK, WLTR, WTBG, and WWZZ. Each station plays a different one of these five types of music: classical, country, jazz, muzak, and rock. From the information given, determine the type of music played on each station as well as its ranking in popularity from one to five.\n","clues":["WKCK ranked higher than the jazz station but lower than the station that plays muzak.\n","WTBG does not play rock or classical music.\n","The classical station ranked lower than WL TR.\n","WTBG ranked higher than the station that plays muzak but lower than WWZZ.\n"],"types":[{"type":"Rank_","vals":[1,2,3,4,5]},{"type":"Radio Station","vals":["WIGT","WKCK","WLTR","WTBG","WWZZ"]},{"type":"Music Type","vals":["Classical","Country","Jazz","Muzak","Rock"]}],"solution2":["044","131","223","310","402"]},{"name":"CB'ers","desc":"The \"handles\" of five CB'ers are All 'Round Guy, Big Daddy, Hot Wheels, Lightning, and Shifty. In alphabetical order their real names are Al, Gus, Herb, Ken, and Pete. They are each a different one of these five occupations: delivery man, realtor, repairman, salesman, and trucker. From the information given, determine each man's \"handle\" and occupation.\n","clues":["The salesman is not Pete or Ken and neither of these three is called Shifty.\n","The realtor is not named Al or Pete and neither of these three goes by the \"handle\" of All 'Round Guy or Shifty.\n","Big Daddy is not the \"handle\" of Pete or the realtor.\n","Of Ken and Herb, one is the trucker and one is named Hot Wheels.\n","Of the salesman and the repairman, one is Gus and one goes by the \"handle\" of Lightning.\n"],"types":[{"type":"Nickname","vals":["Guy","Big Daddy","Hot Wheels","Lightning","Shifty"]},{"type":"First","vals":["Al","Gus","Herb","Ken","Pete"]},{"type":"Occupation","vals":["Delivery Man","Realtor","Repairman","Salesman","Trucker"]}],"solution2":["013","100","231","342","424"]},{"name":"Car Pool","desc":"Three men named Greene, Grey, and Tann, along with two women named Browne and Whyte, each drive the car in their car pool on a different one of the five weekdays each week. Each person's car is a different one of these five colors: brown, gray, green, tan, and white. From the information given, determine the day on which each person drives, as well as the color of his or her car.\n","clues":["The color of no person's car is similar to his or her name.\n","They ride in the green car earlier in the week than in the tan car but later than in the gray car.\n","The woman who drives the brown car drives later in the week than Mr. Greene but earlier than Mr. Grey, who is not the man who drives on Friday.\n","The man who drives the tan car drives earlier in the week than the man who drives the white car but later than Ms. Browne, who does not drive on Monday.\n","Ms. Browne does not drive on Tuesday.\n"],"types":[{"type":"Weekday_","vals":["Monday","Tuesday","Wednesday","Thursday","Friday"]},{"type":"Full","vals":["Mr. Greene","Mr. Grey","Mr. Tann","Ms. Browne","Ms. Whyte"]},{"type":"Color","vals":["Brown","Gray","Green","Tan","White"]}],"solution2":["004","140","221","332","413"]},{"name":"Bay Area Mysteries","desc":"Sam Chovell is a private detective working in the Bay Area. One month he helped the police to solve five mysteries. The crimes involved were arson, embezzlement, kidnapping, murder, and robbery. Each of the crimes occurred in a different one of these five cities: Berkeley, Oakland, Palo Alto, San Francisco, and San Jose. The primary clue that he used to solve the crime was different in each case, either an eyewitness, fingerprints, a letter, a phone tip, or a tire track: From the information given, determine the location of each type of crime as well as the type of clue that cracked each case.\n","clues":["In no particular order, the mysteries solved in Berkeley, Oakland, and Palo Alto were arson, embezzlement, and the one solved by the evidence of an eyewitness.\n","The tire track and the phone tip were not the clues that solved the crimes of embezzlement or murder.\n","The murder, the kidnapping, and the crime solved by the clue in a letter did not occur in San Jose or Palo Alto.\n","The crime solved by a tire-track clue, the kidnapping, and the robbery did not occur in San Francisco.\n","The crime in Berkeley was not solved by a clue found in a letter.\n"],"types":[{"type":"City","vals":["Berkeley","Oakland","Palo Alto","San Fran.","San Jose"]},{"type":"Crime","vals":["Arson","Embezzlement","Kidnapping","Murder","Robbery"]},{"type":"Evidence","vals":["Eyewitness","Fingerprints","Letter","Phone Tip","Tire Track"]}],"solution2":["020","112","204","331","443"]},{"name":"Commuters","desc":"Five employees at the Wild Fowl Publishing Company each come to work by a different one of these five means: bus, car, railroad, subway, and walking. They hold these five positions at the company: art director, editor, publisher, receptionist, and secretary. Two of them are men named Finch and Marten, while three of them are women named Fulmer, Gannet, and Hawk. From the information given, determine the position held by each person as well as the means by which each one gets to work each day.\n","clues":["Neither of the men walk to work but one is the art director and the other is not the publisher or secretary.\n","The publisher is not named Hawk or Fulmer and none of these three takes the railroad or a car.\n","Mr. Finch does not come by railroad and he is not the editor.\n","The female receptionist is not named Fulmer and neither of these two walks to work.\n","The secretary does not take the bus to work.\n"],"types":[{"type":"Full (2 M, 3 F)","vals":["Mr. Finch","Mr. Marten","Ms. Fulmer","Ms. Gannet","Ms. Hawk"]},{"type":"Transport Mode","vals":["Bus","Car","Railroad","Subway","Walk"]},{"type":"Occupation","vals":["Art Director","Editor","Publisher","Receptionist","Secretary"]}],"solution2":["010","121","234","342","403"]},{"name":"Popular New Secretary","desc":"A popular new secretary at the law firm of Farnsworth, Newman, O'Malley, Price, and Reynolds, is taken to lunch by a different one of those five men on each of the five days of her first week on the job. Each man took her to eat a different one of these five types of food: Chinese, French, Greek, Indian, and Mexican. From the information given, determine whom she went to lunch with on each day and the type of food that they had.\n","clues":["Neither Mr. Newman nor Mr. Reynolds took her to lunch on Thursday or Friday but one took her for Chinese food and the one who took her to lunch earlier than the other took her for Greek food.\n","She went for a Mexican food lunch before her Indian food lunch but after her lunch with Mr. Price.\n","She had lunch with Mr. Farnsworth before her lunch with Mr. O'Malley but after the lunch when she had French food, which was not on Monday.\n","She had lunch with Mr. Newman later in the week than the lunch when she had French food.\n"],"types":[{"type":"Weekday_","vals":["Monday","Tuesday","Wednesday","Thursday","Friday"]},{"type":"Last M","vals":["Farnsworth","Newman","O'Malley","Price","Reynolds"]},{"type":"Food Country","vals":["Chinese","French","Greek","Indian","Mexican"]}],"solution2":["040","131","212","304","423"]},{"name":"Bowling Team Averages","desc":"The averages of the five men on the Brewery bowling team are 220, 211, 201, 198, and 195. The men are named Dennis, Harmon, Ivan, Jerry, and Willie. In alphabetical order their last names are: Boyce, Cardel, Dugon, Plotsky, and Sutain. From the information given, determine each man's first and last name as well as his bowling average.\n","clues":["Of Harmon and Mr. Plotsky, one has the highest average and one has the lowest average.\n","Jerry's average is lower than that of Mr. Sutain but not the lowest.\n","Harmon is not Mr. Boyce.\n","Mr. Dugon is not named Willie but his average is higher than Mr. Sutain's and lower than Ivan's average.\n"],"types":[{"type":"Bowling Score_","vals":[220,211,201,198,195]},{"type":"First M","vals":["Dennis","Harmon","Ivan","Jerry","Willie"]},{"type":"Last M","vals":["Boyce","Cardel","Dugon","Plotsky","Sutain"]}],"solution2":["023","102","244","330","411"]},{"name":"Antique Shopping","desc":"Five women friends went antique shopping together in the old section of town. Their names are Addison, Comisky, Evans, Simmons, and Wallis. They each bought a different one of these five items: chair, desk, lamp, stool, and vase. The items ranged in price from $100.00 to $500.00. From the information given, determine the object bought by each woman as well as its price.\n","clues":["The chair cost less than what Ms. Addison bought but more than what Ms. Wallis bought.\n","The item bought by Ms. Simmons cost more than the item bought by Ms. Evans but less than the lamp.\n","Ms. Comisky bought something that cost more than the lamp but it was not the desk.\n","The vase cost less than the desk but more than the stool.\n"],"types":[{"type":"Price_","vals":["$500.00","$400.00","$300.00","$200.00","$100.00"]},{"type":"Last F","vals":["Addison","Comisky","Evans","Simmons","Wallis"]},{"type":"Item","vals":["Chair","Desk","Lamp","Stool","Vase"]}],"solution2":["001","110","242","334","423"]},{"name":"Sister Cities","desc":"The five cities of Appleboro, Bellville, Cherryvale, Keystown, and Peachburg have each adopted a sister city abroad. Those five cities are Abbemount, Corley, Monmouth, Newton, and Poulson. Each city is located in a different one of these five foreign countries: Australia, Canada, Great Britain, New Zealand, and South Africa. From the information given, determine the name and country location of the sister city of each of the five American towns.\n","clues":["Of Corley and Monmouth, one is in New Zealand and one is in Australia but neither one is the sister city of Appleboro, Bellville, or Peach burg.\n","Newton is not in Great Britain.\n","Of Appleboro and Keystown, one is the sister city of a city in Canada and one is the sister city of the city of Monmouth.\n","The sister city of Bellville, the sister city of Cherryvale, and Poulson are not in either New Zealand or South Africa.\n"],"types":[{"type":"City 1","vals":["Appleboro","Bellville","Cherryvale","Keystown","Peachburg"]},{"type":"City 2","vals":["Abbemount","Corley","Monmouth","Newton","Poulson"]},{"type":"Country","vals":["Australia","Canada","Great Britain","New Zealand","South Africa"]}],"solution2":["041","102","210","323","434"]},{"name":"Where are They Now?","desc":"Five college friends got together for the wedding of an old, mutual friend. Their current occupations are artist, banker, diplomat, florist, and lawyer. Each one currently resides in a different one of these five cities: Cairo (Egypt), Los Angeles, Paris (France), Philadelphia, and Zurich (Switzerland). The two men are named Silver and White, while the three women are named Black, Brown, and Green. From the information given, determine the current occupation and place of residence of each of the five friends.\n","clues":["Ms. Black does not live in Cairo and she is not the woman artist.\n","Ms. Brown and the diplomat live outside of the U.S. but not in Zurich.\n","The five friends are: Ms. Black, Mr. White, the lawyer (who lives in the U.S.), the woman who lives in Paris, and the man who lives in L.A.\n","Mr. Silver is not the banker.\n"],"types":[{"type":"Full (2 M, 3 F)","vals":["Mr. Silver","Mr. White","Ms. Black","Ms. Brown","Ms. Green"]},{"type":"Occupation","vals":["Artist","Banker","Diplomat","Florist","Lawyer"]},{"type":"City","vals":["Cairo","Los Angeles","Paris","Philadelphia","Zurich"]}],"solution2":["031","120","214","302","443"]},{"name":"Video Wizard","desc":"John (Joystick) Jones spends a great deal of his time in the arcades playing his five favorite video games: Hot Rod Racer, Mazerama, Pool Shark, Robot Blaster, and Space Wars. One time he played each of the five games once and achieved these scores: 250,000, 200,000, 150,000, 100,000, and 50,000 points. From the information given, determine the order in which he played the five games and the scores achieved on each one.\n","clues":["His first game, his last game, and Space Wars were not the games on which he got his highest or lowest scores.\n","He got a higher score on Robot Blaster than on Pool Shark but a lower score than on Space Wars.\n","He played Hot Rod Racer later than his highest scoring game but earlier than his second-highest scoring game.\n","He played Mazerama later than Robot Blaster but earlier than Pool Shark; one of these was his highest scoring game but neither of the other two was his lowest scoring game.\n"],"types":[{"type":"Order_","vals":["First","Second","Third","Fourth","Fifth"]},{"type":"Score_","vals":["250,000","200,000","150,000","100,000","50,000"]},{"type":"Game Title","vals":["Hot Rod","Mazerama","Pool Shark","Blaster","Space Wars"]}],"solution2":["023","101","240","314","432"]},{"name":"Divorce","desc":"The marriages of five brothers ended in divorce after various numbers of years married. The five brothers are named James, Jeremy, John, Joseph, and Justin. Their five wives are named Bertrice, Loreen, Luanne, Maybelle, and Rosette. From the information given, determine the name of each brother's wife as well as the number of years that each was married. All five couples were married on the same day.\nAfter solving, years = [10, 8, 5, 4, 3]\n","clues":["Although Justin was married for half as long as Luanne, he was married one year longer than Jeremy, who was married for half as long as Rosette-none of these people are husband and wife.\n","Ten years was the longest marriage.\n","Loreen was married one year longer than Joseph but one year less than Justin.\n","James was not married to Maybelle and neither of them was a part of the couple who were the first or last to get divorced.\n"],"types":[{"type":"Years__","vals":["y4","y3","y2","y1","y0"]},{"type":"First M","vals":["James","Jeremy","John","Joseph","Justin"]},{"type":"First F","vals":["Bertrice","Loreen","Luanne","Maybelle","Rosette"]}],"solution2":["022","104","243","311","430"]},{"name":"Little League Teams","desc":"The final standings at the end of the Little League season put these five teams in the top five positions: Bobcats, Cougars, Lions, Panthers, and Tigers. Each team is sponsored by a different one of these local businesses: Al's Hardware, City Bank, Decker Insurance Company, Joe's Florist, and Mom's Bakery. From the information given, determine the name and sponsor of each team and how they finished in the standings.\n","clues":["The Panthers finished higher in the standings than the City Bank team.\n","Al's Hardware team is not called the Lions and the team sponsored by Mom's Bakery is not called the Bobcats.\n","The Decker Insurance Company team did not do as well as the Lions but they did better than the Cougars who did not finish in fifth place.\n","The Tigers finished higher in the standings than the team sponsored by Mom's Bakery but lower than the team sponsored by Joe's Florist which is not the team that finished first.\n"],"types":[{"type":"Rank_","vals":["First","Second","Third","Fourth","Fifth"]},{"type":"Sports Team","vals":["Bobcats","Cougars","Lions","Panthers","Tigers"]},{"type":"Company","vals":["Hardware","City Bank","Decker Ins.","Joe's Florist","Mom's Bakery"]}],"solution2":["030","123","242","314","401"]},{"name":"Choice of Shows","desc":"The Gold Dust, Gold Horn, Gold Rush, Silver Bell, and Silver Dollar are five popular showplaces on the strip. At each club one week a different one of these five singers was performing: Carol Channing, Tom Jones, Liza Minnelli, Wayne Newton, and Andy Williams. Opening the show for each of them was a different one of these five comics: David Brenner, George Carlin, Gilda Radner, Joan Rivers, and Lily Tomlin. From the information given, determine the singer and comic performing at each club.\n","clues":["The only place where the performers are both women is the Gold Rush and the only place where the performers are both men is the Gold Horn.\n","Brenner and Tomlin are appearing in places whose names have \"Silver\" in them, but Channing is not.\n","The male comic appearing with Newton is not Brenner.\n","The male singer appearing with Radner is not Williams, and none of these is appearing at the Silver Bell.\n"],"types":[{"type":"Showplace","vals":["Gold Dust","Gold Horn","Gold Rush","Silver Bell","Silver Dollar"]},{"type":"Last (3 M, 2 F)","vals":["Channing","Jones","Minnelli","Newton","Williams"]},{"type":"Last (2 M, 3 F)","vals":["Brenner","Carlin","Radner","Rivers","Tomlin"]}],"solution2":["012","131","203","320","444"]},{"name":"Lucky Charms","desc":"Baseball players are notoriously superstitious. Blacket, Bluet, Browning, Greenfield, and Whitehall are five players on the Boomtown Bombers who each carry a different lucky charm with them in every game. The charms are a four-leaf clover, a penny, a rabbit's foot, a ribbon, and a silver dollar. The five positions that they play are centerfield, first base, right field, shortstop, and third base. From the information given, determine each player's lucky charm as well as his position.\n","clues":["Neither Browning nor the two outfielders have a coin as a lucky charm.\n","Bluet is not an outfielder.\n","Greenfield is an outfielder and Whitehall's infield position is not first base but neither has his lucky charm a clover or a penny and Blacket does not have either of these two lucky charms.\n","Blacket and Bluet are not the players who play first base or third base and neither of them has a lucky ribbon.\n","The centerfielder's lucky charm is not a rabbit's foot.\n"],"types":[{"type":"Last M","vals":["Blacket","Bluet","Browning","Greenfield","Whitehall"]},{"type":"Lucky Charm","vals":["Clover","Penny","Rabbit's Foot","Ribbon","Silver Dollar"]},{"type":"Baseball Position","vals":["Centerfielder","First Baseman","Right Fielder","Greenfield","Whitehall"]}],"solution2":["022","113","201","330","444"]},{"name":"Wearing of the Green","desc":"Five Irish-Americans each wore a different article of green clothing on St. Patrick's Day: hat, scarf, shirt, tie, and trousers. The five men are named Brian, Francis, Frank, Liam, and Mike. No man has the same first and last initial, and the last names are Brady, Flanagan, Lynch, Maguire, and Murphy. From the information given, determine each man's first and last name as well as the article of green clothing that he wore on St. Patrick's Day.\n","clues":["Francis and Mr. Maguire did not wear a green shirt.\n","Mr. Flanagan, Mr. Maguire, and Brian did not wear a green hat or scarf.\n","Mike, Liam, and Mr. Brady did not wear a green shirt or tie.\n","Mike is not Mr. Flanagan and neither wore a green scarf.\n"],"types":[{"type":"First M","vals":["Brian","Francis","Frank","Liam","Mike"]},{"type":"Last M","vals":["Brady","Flanagan","Lynch","Maguire","Murphy"]},{"type":"Clothing","vals":["Hat","Scarf","Shirt","Tie","Trousers"]}],"solution2":["042","101","233","314","420"]},{"name":"Rubik's Cube Contest","desc":"The six top finishers in a Rubik's cube contest solved the cube in 0:29, 0:35, 0:51, 1:10, 1:26, and 1:30. Each started by completing a top color. Each one chose a different color to start with: blue, green, orange, red, white, and yellow. Of the six, three were boys named Eric, Oswald, and Wilbur, and three were girls named Gretchen, Lily, and Wendy. From the information given, determine how long it took for each one to solve the cube and what color each one used as a top starting color.\n","clues":["Gretchen's time was faster than Lily's time but slower than Eric's time; these three kids, like the girl who won the contest, did not begin with orange or green on top.\n","The girl who started with red finished later than the kid who started with orange but earlier than the girl who started with blue.\n","The kid who started with yellow on top finished earlier than Wilbur but not first.\n","Lily finished the cube earlier than Oswald.\n"],"types":[{"type":"Duration_","vals":["0:29","0:35","0:51","1:10","1:26","1:30"]},{"type":"First (3 M, 3 F)","vals":["Eric","Gretchen","Lily","Oswald","Wendy","Wilbur"]},{"type":"Color","vals":["Blue","Green","Orange","Red","White","Yellow"]}],"solution2":["044","105","252","313","420","531"]},{"name":"Long Trip","desc":"In order to make time during the long ride back to school, five friends traveling in the same car only made one stop, at which time they got gas, had lunch, and used the men's room. When they got back into the car, each man, including the driver, took a seat different from the one he had occupied during the first half of the journey. From the information given, determine where Bruce, Jacob, Neil, Oscar, and Sanford sat during the two halves of the journey.\n","clues":["Only one of the five guys was in the front seat of the car for both halves of the trip.\n","At the stop Oscar switched from the back to the front and Sanford switched from the front to the back.\n","Jacob and Neil switched positions.\n","The person who drove for the second half of the trip had been sitting in the center in the back for the first half of the trip at which time Neil was not sitting on his right.\n"],"types":[{"type":"First M","vals":["Bruce","Jacob","Neil","Oscar","Sanford"]},{"type":"Car Seat 1","vals":["Center Rear1","Driver1","Front Pass.1","Left Rear1","Right Rear1"]},{"type":"Car Seat 2","vals":["Center Rear2","Driver2","Front Pass.2","Left Rear2","Right Rear2"]}],"solution2":["012","143","234","301","420"]},{"name":"Country Fair","desc":"The carnival was in town for the week and five friends spent many evenings there. They are two boys named Carl and Clark, and three girls named Carol, Clara, and Clare. They each had a favorite ride at the carnival, either the dodgems, ferris wheel, round-up, scrambler, or whip. They also liked to spend time in the midway trying to win prizes at their favorite booths. Each had a different favorite booth: baseball throw, darts, horse racing, ring toss, and sledge hammer. From the information given, determine the favorite ride and midway attraction of each of the five friends.\n","clues":["One boy likes throwing baseballs and the other boy likes riding the whip.\n","The girl who likes the dodgems and the girl who likes the ring toss are not named Clara.\n","Carl does not like the round-up and his favorite contest is not darts or the horse race.\n","Carol is not the girl who likes the ferris wheel or the girl who likes the scrambler and Carol's favorite contest is not darts or ring toss.\n","Clare's favorite ride is not the ferris wheel.\n"],"types":[{"type":"First (2 M, 3 F, C*)","vals":["Carl","Carol","Clara","Clare","Clark"]},{"type":"Booth","vals":["Baseball","Darts","Horse Race","Ring Toss","Hammer"]},{"type":"Ride","vals":["Dodgems","Ferris Wheel","Round-up","Scrambler","Whip"]}],"solution2":["044","120","211","333","402"]},{"name":"Wake-up Calls","desc":"Three women named Brewster, Desmond, and Farrell along with two men named Donahue and Hendricks are all staying on the ninth floor of the Dawnlight Hotel. They have each left a wake-up call with the desk clerk for a different time in the morning: either 7:00, 7:15, 7:20, 7:30, or 7:45. Their room numbers are 945, 930, 920, 915, and 900. From the information given, determine each person's room number and the time each one wishes to be called in the morning.\n","clues":["A woman has the highest room number and a man has the lowest room number but neither wishes to be awakened at 7:00 or 7:45.\n","The woman in room 915 wishes to be called earlier than the man in room 930 but later than Ms. Farrell who is not the woman who wishes to be called before everybody else.\n","Ms. Brewster's room number is lower than the room number of the person who wishes to be called first.\n","Mr. Donahue's room number is lower than Ms. Brewster's room number and he wishes to be called later than she.\n"],"types":[{"type":"Time_","vals":["7:00","7:15","7:20","7:30","7:45"]},{"type":"First (3 F, 2 M)","vals":["Brewster","Desmond","Donahue","Farrell","Hendricks"]},{"type":"Room Number_","vals":[945,930,920,915,900]}],"solution2":["012","130","203","324","441"]},{"name":"Fish-Raising Kids","desc":"Five friends enjoy raising tropical fish. They each have a different one of these size tanks: 50 gallons, 30 gallons, 25 gallons, 20 gallons, and JO gallons. There are three boys named Arthur, Martin, and Maurice as well as two girls named Alice and Maureen. They each raise a different one of these types of fish: angelfish, cichlids, gouramis, guppies, and neon tetras. From the information given, determine the size of each person's tank and the type of fish raised.\n","clues":["Neither Martin nor Alice raise neon tetras and the same is true of the girl with the largest tank of all and the boy with the smallest tank of all.\n","Maurice does not raise gouramis.\n","Arthur's tank is larger than the tank in which angelfish are raised which is not the smallest tank.\n","Martin has a smaller tank than the kid who raises cichlids but a larger one than the tank in which neon tetras are raised.\n"],"types":[{"type":"Volume_","vals":["50 gal.","30 gal.","25 gal.","20 gal.","10 gal."]},{"type":"First (3 M, 2 F)","vals":["Alice","Arthur","Martin","Maureen","Maurice"]},{"type":"Fish Type","vals":["Angelfish","Cichlids","Gouramis","Guppies","Neon Tetras"]}],"solution2":["031","122","214","300","443"]},{"name":"Book of the Month Club","desc":"The first choice and second choice in a popular book club for the months January through May were mysteries, romances, science fiction, thrillers, and westerns. From the information given, determine the first and second choice offered by the club for each month.\n","clues":["In no single month were the first and second choices both the same type of book and in no two months were the first and second choices the same two types of books in reverse order.\n","In January and May neither the first nor the second choice was a western or a mystery.\n","A mystery was offered as the second choice earlier in the year than the month in which a mystery was offered as a first choice but later in the year than the month in which a western was offered as a first choice.\n","A romance novel was offered as a second choice earlier than a romance novel was offered as a first choice but later than the month in which a science fiction book was offered as a second choice.\n"],"types":[{"type":"Month_","vals":["January","February","March","April","May"]},{"type":"Book Type 1","vals":["Mystery1","Romance1","Sci. Fiction1","Thriller1","Western1"]},{"type":"Book Type 2","vals":["Mystery2","Romance2","Sci. Fiction2","Thriller2","Western2"]}],"solution2":["032","141","220","314","403"]},{"name":"Dieters' Club","desc":"A new diet club was started in Phattsburg. The first five members to join up are named Biggs, Gross, House, Piles, and Tubbs. Two of them are men named Barney and Whalen, while three of them are women named Bertha, Fanny, and Fatima. Each started out at a different. one of these five weights: 300 lbs., 275 lbs., 250 lbs., 225 lbs., and 200 lbs. After three months on the diet, each person had lost a different amount of weight, either 125, 100, 75, 50, or 25 lbs. From the information given, determine each person's first and last name, original weight, and amount of weight lost.\n","clues":["At the beginning of the diet Whalen weighed less than Mr. Piles and the woman who lost the most weight in the whole group but more than Ms. House and the woman who lost the least weight of the whole group.\n","Barney did not lose exactly 75 lbs. and he is not now the same weight as Ms. Gross.\n","Mr. Tubbs, at the beginning of the diet, weighed more than Ms. Biggs and less than Fanny.\n","Fatima started out lighter but lost twice as much weight as Ms. Biggs.\n"],"types":[{"type":"Weight_","vals":["300 lbs.","275 lbs.","250 lbs.","225 lbs.","200 lbs."]},{"type":"Weight Delta_","vals":["125 lbs.","100 lbs.","75 lbs.","50 lbs.","25 lbs."]},{"type":"First (2 M, 3 F)","vals":["Barney","Bertha","Fanny","Fatima","Whalen"]},{"type":"Last","vals":["Biggs","Gross","House","Piles","Tubbs"]}],"solution2":["0103","1021","2244","3410","4332"]},{"name":"Workdays","desc":"Ms. Smith plans her week's work and pleasure precisely. She schedules a different activity each weekday for the morning, afternoon, and evening, in addition to her daily chores of making beds, doing dishes, etc. In the mornings she keeps one free, works at a hospital, does her ironing, does her laundry, and helps out at the preschool that her youngest child attends. The activities occupying her afternoons are cleaning the bathrooms, gardening, cleaning the kitchen, cleaning the upstairs, and vacuuming. The five activities that occupy her evenings are bowling, bridge, night class at the local college, gym workout, and going to the movies. From the information given, determine what she does in the morning, afternoon, and evening of each day Monday through Friday.\n","clues":["The morning that she has free, except for daily chores, is on an earlier day of the week than the afternoon when she does the gardening but later than the afternoon when she does the vacuuming, which is not Monday.\n","Her gym workout is not on Friday but it is later in the week than the night when she goes bowling, which in turn is later in the week than the night when she plays bridge, but none of these evening activities is on the same day when she has a free morning.\n","She does the laundry and cleans the bathroom on the same day.\n","On the day she has an afternoon to work in the garden, she has already been to her night class but she has yet to put in her morning of volunteer work at the hospital.\n","She works at the preschool later in the week than the day when she cleans the kitchen floor.\n"],"types":[{"type":"Weekday_","vals":["Monday","Tuesday","Wednesday","Thursday","Friday"]},{"type":"Activity Morning","vals":["Free","Hospital","Ironing","Laundry","Preschool"]},{"type":"Activity Afternoon","vals":["Bathrooms","Gardening","Kitchen","Upstairs","Vacuuming"]},{"type":"Activity Evening","vals":["Bowling","Bridge","Class","Gym","Movies"]}],"solution2":["0301","1240","2022","3413","4134"]},{"name":"Returning from Vacation","desc":"Five couples who live on Maple Avenue in Forestville were all away on vacation for the same two weeks during the summer. The Smiths had kept the keys to the houses of all five couples in order to water the plants. The couples are named Finn, Gersten, Hawkins, O'Malley, and Webster. They were each on vacation in a different one of these five cities: Denver, Las Vegas, Los Angeles, Reno, and Vancouver. Each couple returned by a different means of transportation, either airplane, camper, bus, car, or train. From the information given, determine the order in which they returned, where they had been, and how they got home.\n","clues":["The Websters arrived home earlier than the couple who were in Las Vegas but later than the couple who came back by airplane.\n","The couple returning from Reno did not come by camper but they arrived after the couple returning from L.A.\n","The Hawkins arrived home before the Gerstens but after the Finns, who didn't return by airplane.\n","The couple who returned by bus arrived home later than the couple who returned by train but before the Hawkinses, however, none of these three couples had been to Denver or Vancouver.\n","The first couple to arrive home had not been to L.A., Reno, or Vancouver, and neither had the Finns.\n"],"types":[{"type":"Order_","vals":["First","Second","Third","Fourth","Fifth"]},{"type":"Last","vals":["Finn","Gersten","Hawkins","O'Malley","Webster"]},{"type":"Transport Mode","vals":["Airplane","Camper","Bus","Car","Train"]},{"type":"City","vals":["Denver","Las Vegas","Los Angeles","Reno","Vancouver"]}],"solution2":["0300","1041","2422","3233","4114"]},{"name":"Dog House","desc":"Five women friends each live on a different floor of the North Star apartment building. Their names are Edith, Hannah, Linda, Michelle, and Sarah. They each own a dog. Each dog is one of these types: cocker spaniel, dachshund, pekingese, poodle, and schnauzer. The dogs are named Buttercup, Daisy, Pansy, Rose, and Violet. From the information given, determine the floor on which each woman lives as well as the name and type of dog owned by each one.\n","clues":["Linda lives on a higher floor than the dog named Buttercup but on a lower floor than the pekingese, which is not named Rose.\n","Edith and her dog live on a higher floor than the dog named Pansy but on a lower floor than the dog named Buttercup, however, none of these dogs is a schnauzer.\n","The dachshund lives on a higher floor than the poodle but a lower floor than Sarah, whose dog is not a pekingese.\n","Violet is not a schnauzer but lives on a lower floor than Michelle.\n"],"types":[{"type":"Floor Level_","vals":["Fifth","Fourth","Third","Second","First"]},{"type":"First F","vals":["Edith","Hannah","Linda","Michelle","Sarah"]},{"type":"Dog Type","vals":["Cocker","Dachshund","Pekingese","Poodle","Schnauzer"]},{"type":"Dog Name","vals":["Buttercup","Daisy","Pansy","Rose","Violet"]}],"solution2":["0321","1243","2400","3014","4132"]},{"name":"Interpreters","desc":"There are five interpreters at the U.N. whose names are Aix, Dee, Jay, Kay, and Oh. Each one is a native speaker of a different one of these five languages English, French, German, Hebrew, and Japanese. They each speak two other languages fluently. The five best languages spoken are Arabic, Chinese, Persian, Russian, and Turkish. As it happens, the five second best languages of the five interpreters are these same languages. Aix and Dee are women while Jay, Kay, and Oh are men. From the information given, determine each person's native language and his first and second best foreign language.\n","clues":["The native English speaker doesn't speak Arabic at all.\n","The Japanese and the German both list Russian as one of the languages that they speak but neither man is Mr. Jay who is not French.\n","Mr. Kay is not Japanese.\n","Ms. Dee's best foreign language is the same as Mr. Oh's second best foreign language.\n","Neither woman speaks Persian but the best foreign language of one of them is Chinese and the second best foreign language of the other is Arabic.\n"],"types":[{"type":"First (2 F, 3 M)","vals":["Aix","Dee","Jay","Kay","Oh"]},{"type":"Language Native","vals":["English","French","German","Hebrew","Japanese"]},{"type":"Language First","vals":["Arabic1","Chinese1","Persian1","Russian1","Turkish1"]},{"type":"Language Second","vals":["Arabic2","Chinese2","Persian2","Russian2","Turkish2"]}],"solution2":["0140","1014","2302","3223","4431"]},{"name":"Amateur Hour","desc":"The five top finishers in an amateur contest at the local high school in Middletown are named Carl, Derek, James, Milton, and Wendel. Their last names are Cudahy, Donnelly, Jenkins, Marlow, and Wilkins. No contestant has a double-letter monogram. Their five acts were as a juggler, magician, mimic, singer, and violinist. From the information given, determine the order of finish in the contest for each type of performer as well as each one's first and last name.\n","clues":["The mimic finished better than James but not as well as Derek.\n","James is not the juggler.\n","Mr. Wilkins did better than Mr. Marlow but not as well as Mr. Cudahy who didn't do as well as the magician.\n","Milton's last name is not Wilkins or Donnelly.\n","The violinist did not finish as well as Mr. Marlow who didn't do as well as Mr. Donnelly.\n"],"types":[{"type":"Rank_","vals":["First","Second","Third","Fourth","Fifth"]},{"type":"Act","vals":["Juggler","Magician","Mimic","Singer","Violinist"]},{"type":"First M","vals":["Carl","Derek","James","Milton","Wendel"]},{"type":"Last","vals":["Cudahy","Donnelly","Jenkins","Marlow","Wilkins"]}],"solution2":["0101","1010","2244","3323","4432"]},{"name":"Class Reunion","desc":"At the twenty-year class reunion of the class of 1962 of the Littleboro High School, the ex-president, ex-vice-president, ex-secretary, ex-treasurer, and ex-prom committee chairperson of the senior class all showed up. Their last names are Carter, Conway, Matson, Rollings, and Wilson. Three of them are men named Bill, Glen, and Phil. Two of them are women named Liz and Mary. At present they each hold a different one of these five jobs: banker, bus driver, C.P.A., doctor, and teacher. From the information given, determine the first and last name of each class officer, the class position each one held, and each one's present job.\n","clues":["The ex-president and ex-treasurer are both males but it is the other male who works as a C.P.A.\n","Bill's last name does not begin with a \"C\" and Mary's last name is not Wilson.\n","Mr. Conway, Phil, and the guy who used to be the secretary do not work as either a banker or a bus driver.\n","Liz and the banker are not named Matson or Carter and none of these four is the ex-president.\n","The ex-president, ex-vice-president, and the doctor are not named Wilson.\n"],"types":[{"type":"Ex-Role","vals":["Ex-president","Ex-vice-pres.","Ex-secretary","Ex-treasurer","Ex-prom comm."]},{"type":"First (3 M, 2 F)","vals":["Bill","Glen","Liz","Mary","Phil"]},{"type":"Last","vals":["Carter","Conway","Matson","Rollings","Wilson"]},{"type":"Occupation","vals":["Banker","Bus Driver","C.P.A.","Doctor","Teacher"]}],"solution2":["0114","1330","2402","3023","4241"]},{"name":"Rock Tour","desc":"The Woebegones are a European rock band touring the United States. Five of the cities at which they performed concerts are Buffalo, Cleveland, Kansas City, Los Angeles, and New York City. In each of these cities the concert was opened by one of these five bands: Crazy Glues, Double Double, Draw Backward, Right Turn, and Street Crazed. The attendances at the five concerts were 70,000, 60,000, 50,000, 30,000, and 25,000. From the information given., determine the order in which they played the five cities, the attendance, and the name of the opening band.\n","clues":["Cleveland was later in the tour than Buffalo but earlier than K.C. which was earlier than the city where they had the largest crowd.\n","Draw Backward was not the opening act for the largest crowd but they opened for a larger crowd than the Crazy Glues.\n","Street Crazed opened in a city that was later in the tour than N.Y.C. but earlier than Cleveland.\n","The crowd when Double Double was the opening act was larger than in Cleveland but exactly one half of the crowd at the N.Y.C. concert.\n"],"types":[{"type":"Order_","vals":["First","Second","Third","Fourth","Fifth"]},{"type":"City","vals":["Buffalo","Cleveland","K.C.","L.A.","and N.Y.C"]},{"type":"Band","vals":["Crazy Glues","Double Double","Draw Backward","Right Turn","Street Crazed"]},{"type":"Count_","vals":["70,000","60,000","50,000","30,000","20,000"]}],"solution2":["0421","1042","2104","3213","4330"]},{"name":"Arcade Prizes","desc":"Tony manages the dart-throwing booth in the arcade at the local amusement park. He keeps the prizes available for the rubes to win on a set of five shelves. On each shelf he keeps three different types of prizes. On the left-hand sides of the shelves he keeps ashtrays, electronic games, toy trains, watches, and water pistols. On the right-hand sides of the shelves he keeps blenders, stereos, stuffed animals, TVs, and whistles. On the centers of the shelves he keeps candy, clocks, dolls, toy boats, and wallets. From the information given, determine which prizes he keeps on the center, the left-hand side, and the right-hand side of each of the five shelves.\n","clues":["Toy boats are on a lower shelf than the one that holds electronic games and TVs but on a higher shelf than the one that holds water pistols and blenders.\n","Dolls and TVs are not on the same shelf.\n","Wallets are on a higher shelf than candy but on a lower shelf than blenders; however, toy trains are not on the same shelf as any of these items.\n","Watches are on a higher shelf than whistles but on a lower shelf than the stereos.\n"],"types":[{"type":"Shelf Level_","vals":["Fifth","Fourth","Third","Second","First"]},{"type":"Prize Left","vals":["Ashtrays","Games","Toy Trains","Watches","Pistols"]},{"type":"Prize Right","vals":["Blenders","Stereos","Animals","T.V.'s","Whistles"]},{"type":"Prize Center","vals":["Candy","Clocks","Dolls","Toy Boats","Wallets"]}],"solution2":["0113","1231","2424","3342","4004"]},{"name":"Picnic Toys","desc":"The five Johnson children each brought a toy to the family picnic on the Fourth of July. Their ages are 16, 12, 10, 8, and 6. Their names are Alice, Billy, Brenda, Greg, and Sally. A ball, a frisbee, a hoop, a kite, and a rope are the five toys that they brought, which are each a different one of these five colors: blue, gold, red, silver, and white. From the information given, determine each child's name and age as well as the color of the toy that each one brought.\n","clues":["The 6-year-old and the 16-year-old children are the same sex and one brought something silver and the other brought the frisbee.\n","Toe rope and the kite are not blue or gold.\n","Alice is older than Billy but younger than the girl who brought the hoop.\n","The girl who brought the kite is older than Brenda who is older than the kid who brought the ball.\n","The kid who brought the red toy is older than the girl who brought the rope but younger than the girl who brought the blue toy.\n"],"types":[{"type":"Age_","vals":[16,12,10,8,6]},{"type":"First (2 M, 3 F)","vals":["Alice","Billy","Brenda","Greg","Sally"]},{"type":"Toy","vals":["Ball","Frisbee","Hoop","Kite","Rope"]},{"type":"Color","vals":["Blue","Gold","Red","Silver","White"]}],"solution2":["0411","1320","2032","3244","4103"]},{"name":"Sweepstakes","desc":"Five women won the top five prizes in a big national sweepstakes contest. Their names are Heather, Holly, Laurel, Lily, and Rose. Their last names are Heatherton, Hollyer, Laurelton, Lilyman, and Rosen. No woman's first name is repeated in her last name. In alphabetical order, the five prizes were a boat, a car, cash, a house, and a trip. From the information given, determine the first and last name of each of the winners, the prize won, and whether it was the first, second, third, fourth, or fifth prize.\n","clues":["Ms. Laurelton won a higher prize than the woman who won the trip but a lower prize than Lily who did not win the first prize.\n","Ms. Lilyman and Holly did not win the car.\n","The trip was a higher prize than the one that Holly won but a lower prize than the one that Heather won which was not the first prize.\n","The cash was a higher prize than the car but a lower prize than the one that Laurel won.\n","Ms. Heatherton won a higher prize than Ms. Hollyer but a lower prize than the house.\n"],"types":[{"type":"Rank_","vals":["First","Second","Third","Fourth","Fifth"]},{"type":"Prize","vals":["Boat","Car","Cash","House","Trip"]},{"type":"First F","vals":["Heather","Holly","Laurel","Lily","Rose"]},{"type":"Last","vals":["Heatherton","Hollyer","Laurelton","Lilyman","Rosen"]}],"solution2":["0323","1230","2102","3441","4014"]},{"name":"School Fair","desc":"Three girls named Beverly, Julie, and Lucy, as well as two boys named Philip and Warren, each managed a stall at the school fair. The last names of the five children are Brewster, Burger, Glover, Latham, and Standish. The five booths managed were a book stall, a cake stall, a crafts stall, a funny fotos booth, and a penny toss game. The profits made at the booths were $80.00, $65.00, $50.00, $40.00, and $25.00. From the information given, determine the first and last name of each child, the type of booth managed, and the amount of profit made.\n","clues":["Beverly and the girl who made the most money did not operate the funny fotos booth.\n","Lucy made less money than the cake booth but more than the penny toss booth.\n","Miss Burger made only half as much money as Philip but neither operated the cake or crafts booths.\n","Warren made more money than the Standish boy but neither operated the funny fotos or penny toss booths.\n","The kid operating the crafts booth made less money than Miss Glover but more than Miss Latham.\n"],"types":[{"type":"Money_","vals":["$80.00","$65.00","$50.00","$40.00","$25.00"]},{"type":"Booth","vals":["Books","Cakes","Crafts","Funny Fotos","Penny Toss"]},{"type":"First (3 F, 2 M)","vals":["Beverly","Julie","Lucy","Philip","Warren"]},{"type":"Last","vals":["Brewster","Burger","Glover","Latham","Standish"]}],"solution2":["0112","1240","2034","3323","4401"]},{"name":"Bird Houses","desc":"Presently being boarded at the Bird House are five birds, which are a canary, a cockatoo, a myna bird, a parakeet, and a parrot. The owners of these birds are named Crane, Finch, Hawk, Heron, and Raven. In alphabetical order, the first names of the two men are Jay and Martin, while the three women are Mavis, Polly, and Robin. They each live on a different one of these five streets: Birdsall Street, Downs Street, Fowler Avenue, Poltrecci Avenue, and Winger Street. From the information given, determine the first and last name of each pet's owner as well as the name of the street on which each one lives.\n","clues":["Polly does not own the parakeet or the parrot but one of these two birds belongs to Ms. Heron and the other one lives on Winger Street.\n","Martin is not Mr. Crane and neither of these two men lives on Birdsall Street or Fowler Avenue.\n","Robin, Ms. Heron, and the woman who lives on Downs Street do not own the myna bird or the parakeet.\n","Ms. Finch, Mr. Hawk, and the canary's owner do not live on Poltrecci Avenue or Birdsall Street.\n","The canary does not live on Fowler Avenue.\n"],"types":[{"type":"Bird Type","vals":["Canary","Cockatoo","Myna Bird","Parakeet","Parrot"]},{"type":"Street Name","vals":["Birdsall","Downs","Fowler","Poltrecci","Winger"]},{"type":"First (2 M, 3 F)","vals":["Jay","Martin","Mavis","Polly","Robin"]},{"type":"Last","vals":["Crane","Finch","Hawk","Heron","and Raven"]}],"solution2":["0134","1241","2300","3412","4023"]}]}